# -*- coding: utf-8 -*-
"""
Created on 2020/11/11
@Author: 你们说的队
@Project: AIRA
@Product: PyCharm
@Description: 数据设置
"""

cities = {  # 城市
    '北京'   : 'bjs', '上海': 'sha', '广州': 'can', '深圳': 'szx', '成都': 'ctu',
    '杭州'   : 'hgh', '武汉': 'wuh', '西安': 'sia', '重庆': 'ckg', '青岛': 'tao',
    '长沙'   : 'csx', '南京': 'nkg', '厦门': 'xmn', '昆明': 'kmg', '大连': 'dlc',
    '天津'   : 'tsn', '郑州': 'cgo', '三亚': 'syx', '济南': 'tna', '福州': 'foc',
    '阿勒泰'  : 'aat', '阿克苏': 'aku', '鞍山': 'aog', '安庆': 'aqg', '安顺': 'ava',
    '阿拉善左旗': 'axf', '阿里': 'ngq', '阿拉善右旗': 'rht', '阿尔山': 'yie',
    '巴中'   : 'bzx', '百色': 'aeb', '包头': 'bav', '毕节': 'bfj', '北海': 'bhy',
    '博乐'   : 'bpl', '保山': 'bsd', '白城': 'dbc', '布尔津': 'kji', '白山': 'nbs',
    '巴彦淖尔' : 'rlk', '昌都': 'bpx', '承德': 'cde', '常德': 'cgd', '长春': 'cgq',
    '朝阳'   : 'chg', '赤峰': 'cif', '长治': 'cih', '沧源': 'cwj', '常州': 'czx',
    '池州'   : 'juh', '潮州': 'swa', '潮汕': 'swa', '大同': 'dat', '达县': 'dax',
    '达州'   : 'dax', '稻城': 'dcy', '丹东': 'ddg', '迪庆': 'dig', '大理': 'dlu',
    '敦煌'   : 'dnh', '东营': 'doy', '大庆': 'dqa', '德令哈': 'hxd', '德宏': 'lum',
    '鄂尔多斯' : 'dsn', '额济纳旗': 'ejn', '恩施': 'enh', '二连浩特': 'erl', '阜阳': 'fug',
    '抚远'   : 'fyj', '富蕴': 'fyn', '果洛': 'gmq', '格尔木': 'goq', '广元': 'gys',
    '固原'   : 'gyu', '赣州': 'kow', '贵阳': 'kwe', '桂林': 'kwl',
    '红原'   : 'ahj', '海口': 'hak', '河池': 'hcj', '邯郸': 'hdg', '黑河': 'hek',
    '呼和浩特' : 'het', '合肥': 'hfe', '淮安': 'hia', '怀化': 'hjj', '海拉尔': 'hld',
    '哈密'   : 'hmi', '衡阳': 'hny', '哈尔滨': 'hrb', '和田': 'htn', '花土沟': 'htt',
    '霍林郭勒' : 'huo', '惠阳': 'huz', '惠州': 'huz', '汉中': 'hzg',
    '黄山'   : 'txn', '呼伦贝尔': 'xrq', '景德镇': 'jdz', '加格达奇': 'jgd',
    '嘉峪关'  : 'jgn', '井冈山': 'jgs', '景洪': 'jhg', '金昌': 'jic', '九江': 'jiu',
    '晋江'   : 'jjn', '荆门': 'jm1', '佳木斯': 'jmu', '济宁': 'jng', '锦州': 'jnz',
    '建三江'  : 'jsj', '鸡西': 'jxa', '九寨沟': 'jzh', '揭阳': 'swa',
    '库车'   : 'kca', '康定': 'kgt', '喀什': 'khg', '凯里': 'kjh', '库尔勒': 'krl',
    '克拉玛依' : 'kry', '黎平': 'hzh', '澜沧': 'jmj', '连城': 'lcx', '龙岩': 'lcx',
    '临汾'   : 'lfq', '兰州': 'lhw', '丽江': 'ljg', '荔波': 'llb', '吕梁': 'llv',
    '临沧'   : 'lnj', '陇南': 'lnl', '六盘水': 'lpf', '拉萨': 'lxa', '洛阳': 'lya',
    '连云港'  : 'lyg', '临沂': 'lyi', '柳州': 'lzh', '泸州': 'lzo', '林芝': 'lzy',
    '芒市'   : 'lum', '牡丹江': 'mdg', '绵阳': 'mig', '梅县': 'mxz',
    '梅州'   : 'mxz', '中国马公': 'mzg', '满洲里': 'nzh', '漠河': 'ohe', '南昌': 'khn',
    '南充'   : 'nao', '宁波': 'ngb', '宁蒗': 'nlh', '南宁': 'nng',
    '南阳'   : 'nny', '南通': 'ntg', '攀枝花': 'pzi', '普洱': 'sym',
    '琼海'   : 'bar', '秦皇岛': 'bpe', '祁连': 'hbq', '且末': 'iqm', '庆阳': 'iqn',
    '黔江'   : 'jiq', '泉州': 'jjn', '衢州': 'juz', '齐齐哈尔': 'ndg', '日照': 'riz',
    '日喀则'  : 'rkz', '若羌': 'rqa', '神农架': 'hpg', '石狮': 'jjn', '莎车': 'qsz',
    '沈阳'   : 'she', '石河子': 'shf', '石家庄': 'sjw', '上饶': 'sqd', '三明': 'sqj',
    '汕头'   : 'swa', '十堰': 'wds', '邵阳': 'wgn', '松原': 'ysq', '台州': 'hyn',
    '塔城'   : 'tcg', '腾冲': 'tcz', '铜仁': 'ten', '通辽': 'tgo',
    '天水'   : 'thq', '吐鲁番': 'tlq', '通化': 'tnh',
    '唐山'   : 'tvs', '太原': 'tyn', '泰州': 'yty', '五大连池': 'dtu',
    '乌兰浩特' : 'hlh', '乌兰察布': 'ucb', '乌鲁木齐': 'urc', '潍坊': 'wef', '威海': 'weh',
    '文山'   : 'wnh', '温州': 'wnz', '乌海': 'wua', '武夷山': 'wus', '无锡': 'wux',
    '梧州'   : 'wuz', '万州': 'wxn', '乌拉特中旗': 'wzq', '巫山': 'wsk', '兴义': 'acx',
    '香格里拉' : 'dig', '夏河': 'gxh', '西双版纳': 'jhg', '新源': 'nlt',
    '咸阳'   : 'sia', '忻州': 'wut', '信阳': 'xai', '襄阳': 'xfn', '西昌': 'xic',
    '锡林浩特' : 'xil', '西宁': 'xnn', '徐州': 'xuz', '延安': 'eny', '银川': 'inc',
    '伊春'   : 'lds', '永州': 'llf', '榆林': 'uyn', '宜宾': 'ybp', '运城': 'ycu',
    '宜春'   : 'yic', '宜昌': 'yih', '伊犁': 'yin', '伊宁': 'yin', '义乌': 'yiw',
    '营口'   : 'ykh', '延吉': 'ynj', '烟台': 'ynt', '盐城': 'ynz', '扬州': 'yty',
    '玉树'   : 'yus', '岳阳': 'yya', '张家界': 'dyg', '芷江': 'hjj', '舟山': 'hsn',
    '扎兰屯'  : 'nzl', '张掖': 'yzy', '昭通': 'zat', '湛江': 'zha', '中卫': 'zhy',
    '张家口'  : 'zqz', '珠海': 'zuh', '遵义': 'zyi',

    '安康'   : 'aka', '阿荣旗': 'ar1', '嘉义': 'cyi', '丹凤': '123', '东阳': 'dyc',
    '鄂托克前旗': 'et2', '佛山': 'fuo', '根河': 'gh1', '甘孜': 'gzg', '湖州': 'hzc',
    '香港'   : 'hkg', '花莲': 'hun', '建德': 'jde', '高雄': 'khh', '金门': 'knh',
    '马祖'   : 'mfk', '澳门': 'mfm', '莫力达瓦旗': 'ml2', '怒江': 'lfh', '南竿': 'lzn',
    '嫩江'   : 'njj', '澎湖': 'mzg', '商洛': 'dfa', '台南': 'tnn', '台北': 'tpe',
    '台东'   : 'ttt', '图木舒克': 'twc', '台中': 'rmq', '镶黄旗': 'hq1', '玉林': 'ylx',
}
flights = {  # 航班
    "北京"   : {
        "dcity": "bjs", "acityInfo": {
            "阿尔山" : "yie", "安康": "aka", "阿克苏": "aku", "鞍山": "aog", "安庆": "aqg", "毕节": "bfj", "巴彦淖尔": "rlk", "巴中": "bzx",
            "包头"  : "bav", "北海": "bhy", "白山": "nbs", "百色": "aeb", "白城": "dbc", "保山": "bsd", "常德": "cgd", "成都": "ctu",
            "长春"  : "cgq", "重庆": "ckg", "长沙": "csx", "常州": "czx", "赤峰": "cif", "朝阳": "chg", "长治": "cih", "达州": "dax",
            "东营"  : "doy", "大理": "dlu", "大庆": "dqa", "丹东": "ddg", "大连": "dlc", "敦煌": "dnh", "二连浩特": "erl",
            "鄂尔多斯": "dsn", "恩施": "enh", "抚远": "fyj", "福州": "foc", "阜阳": "fug", "佛山": "fuo", "广州": "can", "赣州": "kow",
            "固原"  : "gyu", "贵阳": "kwe", "桂林": "kwl", "广元": "gys", "黑河": "hek", "合肥": "hfe", "惠州": "huz", "哈密": "hmi",
            "淮安"  : "hia", "汉中": "hzg", "呼和浩特": "het", "和田": "htn", "海口": "hak", "杭州": "hgh", "怀化": "hjj", "海拉尔": "hld",
            "衡阳"  : "hny", "哈尔滨": "hrb", "黄山": "txn", "佳木斯": "jmu", "嘉峪关": "jgn", "建三江": "jsj", "井冈山": "jgs",
            "景德镇" : "jdz", "金昌": "jic", "鸡西": "jxa", "揭阳": "swa", "九寨沟": "jzh", "济宁": "jng", "昆明": "kmg", "库尔勒": "krl",
            "克拉玛依": "kry", "六盘水": "lpf", "洛阳": "lya", "拉萨": "lxa", "丽江": "ljg", "泸州": "lzo", "柳州": "lzh", "陇南": "lnl",
            "龙岩"  : "lcx", "连云港": "lyg", "临汾": "lfq", "吕梁": "llv", "兰州": "lhw", "临沂": "lyi", "绵阳": "mig", "梅州": "mxz",
            "牡丹江" : "mdg", "满洲里": "nzh", "芒市": "lum", "漠河": "ohe", "南宁": "nng", "南阳": "nny", "南充": "nao", "南通": "ntg",
            "宁波"  : "ngb", "南昌": "khn", "南京": "nkg", "攀枝花": "pzi", "普洱": "sym", "衢州": "juz", "琼海": "bar", "庆阳": "iqn",
            "青岛"  : "tao", "齐齐哈尔": "ndg", "泉州": "jjn", "黔江": "jiq", "日照": "riz", "上饶": "sqd", "上海": "sha", "十堰": "wds",
            "沈阳"  : "she", "石河子": "shf", "三亚": "syx", "松原": "ysq", "三明": "sqj", "深圳": "szx", "邵阳": "wgn", "通辽": "tgo",
            "铜仁"  : "ten", "台州": "hyn", "腾冲": "tcz", "通化": "tnh", "太原": "tyn", "乌海": "wua", "乌兰浩特": "hlh",
            "乌鲁木齐": "urc", "武夷山": "wus", "温州": "wnz", "无锡": "wux", "威海": "weh", "梧州": "wuz", "武汉": "wuh", "万州": "wxn",
            "襄阳"  : "xfn", "锡林浩特": "xil", "西昌": "xic", "西安": "sia", "西双版纳": "jhg", "信阳": "xai", "厦门": "xmn",
            "西宁"  : "xnn", "兴义": "acx", "盐城": "ynz", "伊春": "lds", "银川": "inc", "宜宾": "ybp", "岳阳": "yya", "义乌": "yiw",
            "运城"  : "ycu", "宜春": "yic", "玉林": "ylx", "玉树": "yus", "延吉": "ynj", "延安": "eny", "扬州": "yty", "宜昌": "yih",
            "榆林"  : "uyn", "烟台": "ynt", "伊宁": "yin", "遵义": "zyi", "中卫": "zhy", "昭通": "zat", "湛江": "zha", "珠海": "zuh",
            "张掖"  : "yzy", "舟山": "hsn", "郑州": "cgo", "扎兰屯": "nzl", "张家界": "dyg"}},
    "上海"   : {
        "dcity": "sha", "acityInfo": {
            "鞍山" : "aog", "阿克苏": "aku", "北海": "bhy", "北京": "bjs", "保山": "bsd", "巴彦淖尔": "rlk", "毕节": "bfj", "白山": "nbs",
            "包头" : "bav", "百色": "aeb", "巴中": "bzx", "朝阳": "chg", "长沙": "csx", "重庆": "ckg", "赤峰": "cif", "长治": "cih",
            "成都" : "ctu", "长春": "cgq", "沧源": "cwj", "敦煌": "dnh", "丹东": "ddg", "大同": "dat", "大连": "dlc", "迪庆": "dig",
            "东营" : "doy", "达州": "dax", "大庆": "dqa", "大理": "dlu", "恩施": "enh", "鄂尔多斯": "dsn", "佛山": "fuo", "福州": "foc",
            "抚远" : "fyj", "固原": "gyu", "赣州": "kow", "广州": "can", "桂林": "kwl", "贵阳": "kwe", "和田": "htn", "哈尔滨": "hrb",
            "邯郸" : "hdg", "汉中": "hzg", "呼和浩特": "het", "衡阳": "hny", "海拉尔": "hld", "海口": "hak", "惠州": "huz", "淮安": "hia",
            "黑河" : "hek", "金昌": "jic", "揭阳": "swa", "嘉峪关": "jgn", "佳木斯": "jmu", "鸡西": "jxa", "锦州": "jnz", "济宁": "jng",
            "井冈山": "jgs", "济南": "tna", "景德镇": "jdz", "加格达奇": "jgd", "昆明": "kmg", "库尔勒": "krl", "泸州": "lzo", "丽江": "ljg",
            "连云港": "lyg", "吕梁": "llv", "临汾": "lfq", "澜沧": "jmj", "兰州": "lhw", "临沂": "lyi", "柳州": "lzh", "拉萨": "lxa",
            "陇南" : "lnl", "龙岩": "lcx", "洛阳": "lya", "芒市": "lum", "牡丹江": "mdg", "绵阳": "mig", "梅州": "mxz", "南阳": "nny",
            "南宁" : "nng", "南充": "nao", "南昌": "khn", "南京": "nkg", "攀枝花": "pzi", "普洱": "sym", "齐齐哈尔": "ndg", "泉州": "jjn",
            "琼海" : "bar", "青岛": "tao", "秦皇岛": "bpe", "日照": "riz", "日喀则": "rkz", "石家庄": "sjw", "三亚": "syx", "石河子": "shf",
            "深圳" : "szx", "邵阳": "wgn", "三明": "sqj", "沈阳": "she", "太原": "tyn", "唐山": "tvs", "通化": "tnh", "天津": "tsn",
            "通辽" : "tgo", "腾冲": "tcz", "铜仁": "ten", "梧州": "wuz", "温州": "wnz", "威海": "weh", "万州": "wxn", "武汉": "wuh",
            "乌海" : "wua", "潍坊": "wef", "乌兰浩特": "hlh", "乌鲁木齐": "urc", "西安": "sia", "信阳": "xai", "西双版纳": "jhg",
            "襄阳" : "xfn", "厦门": "xmn", "兴义": "acx", "忻州": "wut", "西昌": "xic", "西宁": "xnn", "锡林浩特": "xil", "岳阳": "yya",
            "宜宾" : "ybp", "玉林": "ylx", "银川": "inc", "宜春": "yic", "宜昌": "yih", "运城": "ycu", "延安": "eny", "烟台": "ynt",
            "延吉" : "ynj", "营口": "ykh", "榆林": "uyn", "伊春": "lds", "珠海": "zuh", "张家界": "dyg", "张掖": "yzy", "湛江": "zha",
            "郑州" : "cgo", "张家口": "zqz", "舟山": "hsn", "昭通": "zat", "中卫": "zhy", "遵义": "zyi"}},
    "广州"   : {
        "dcity": "can", "acityInfo": {
            "安康" : "aka", "阿克苏": "aku", "安庆": "aqg", "鞍山": "aog", "巴中": "bzx", "毕节": "bfj", "北京": "bjs", "保山": "bsd",
            "包头" : "bav", "北海": "bhy", "百色": "aeb", "承德": "cde", "常州": "czx", "池州": "juh", "长沙": "csx", "长治": "cih",
            "长春" : "cgq", "重庆": "ckg", "常德": "cgd", "成都": "ctu", "东营": "doy", "达州": "dax", "大连": "dlc", "大同": "dat",
            "迪庆" : "dig", "稻城": "dcy", "大理": "dlu", "大庆": "dqa", "恩施": "enh", "鄂尔多斯": "dsn", "阜阳": "fug", "福州": "foc",
            "贵阳" : "kwe", "广元": "gys", "赣州": "kow", "淮安": "hia", "海口": "hak", "呼和浩特": "het", "黄山": "txn", "杭州": "hgh",
            "邯郸" : "hdg", "汉中": "hzg", "哈尔滨": "hrb", "合肥": "hfe", "嘉峪关": "jgn", "佳木斯": "jmu", "揭阳": "swa",
            "景德镇": "jdz", "井冈山": "jgs", "济宁": "jng", "济南": "tna", "克拉玛依": "kry", "昆明": "kmg", "喀什": "khg",
            "库尔勒": "krl", "六盘水": "lpf", "陇南": "lnl", "丽江": "ljg", "荔波": "llb", "临沂": "lyi", "兰州": "lhw", "泸州": "lzo",
            "林芝" : "lzy", "临汾": "lfq", "连云港": "lyg", "拉萨": "lxa", "洛阳": "lya", "芒市": "lum", "牡丹江": "mdg", "绵阳": "mig",
            "梅州" : "mxz", "宁蒗": "nlh", "南通": "ntg", "南京": "nkg", "南昌": "khn", "宁波": "ngb", "南充": "nao", "南宁": "nng",
            "南阳" : "nny", "普洱": "sym", "青岛": "tao", "泉州": "jjn", "秦皇岛": "bpe", "齐齐哈尔": "ndg", "日照": "riz", "沈阳": "she",
            "石家庄": "sjw", "三明": "sqj", "十堰": "wds", "三亚": "syx", "上海": "sha", "太原": "tyn", "通化": "tnh", "腾冲": "tcz",
            "台州" : "hyn", "唐山": "tvs", "天津": "tsn", "吐鲁番": "tlq", "铜仁": "ten", "万州": "wxn", "威海": "weh", "乌鲁木齐": "urc",
            "巫山" : "wsk", "潍坊": "wef", "武夷山": "wus", "无锡": "wux", "武汉": "wuh", "温州": "wnz", "乌海": "wua", "文山": "wnh",
            "襄阳" : "xfn", "西安": "sia", "西双版纳": "jhg", "厦门": "xmn", "信阳": "xai", "忻州": "wut", "兴义": "acx", "西昌": "xic",
            "徐州" : "xuz", "西宁": "xnn", "宜春": "yic", "义乌": "yiw", "烟台": "ynt", "宜宾": "ybp", "榆林": "uyn", "银川": "inc",
            "宜昌" : "yih", "运城": "ycu", "盐城": "ynz", "扬州": "yty", "延安": "eny", "延吉": "ynj", "伊春": "lds", "张家界": "dyg",
            "张掖" : "yzy", "昭通": "zat", "郑州": "cgo", "湛江": "zha", "舟山": "hsn", "遵义": "zyi"}},
    "深圳"   : {
        "dcity": "szx", "acityInfo": {
            "阿克苏" : "aku", "安庆": "aqg", "巴中": "bzx", "北京": "bjs", "百色": "aeb", "包头": "bav", "北海": "bhy", "常州": "czx",
            "重庆"  : "ckg", "长沙": "csx", "昌都": "bpx", "长治": "cih", "赤峰": "cif", "长春": "cgq", "成都": "ctu", "池州": "juh",
            "常德"  : "cgd", "达州": "dax", "大同": "dat", "大连": "dlc", "迪庆": "dig", "丹东": "ddg", "大庆": "dqa", "大理": "dlu",
            "鄂尔多斯": "dsn", "恩施": "enh", "阜阳": "fug", "福州": "foc", "贵阳": "kwe", "广元": "gys", "海口": "hak", "呼和浩特": "het",
            "淮安"  : "hia", "哈尔滨": "hrb", "黄山": "txn", "邯郸": "hdg", "汉中": "hzg", "杭州": "hgh", "合肥": "hfe", "济宁": "jng",
            "济南"  : "tna", "景德镇": "jdz", "锦州": "jnz", "井冈山": "jgs", "昆明": "kmg", "柳州": "lzh", "临汾": "lfq", "吕梁": "llv",
            "林芝"  : "lzy", "泸州": "lzo", "陇南": "lnl", "临沧": "lnj", "临沂": "lyi", "兰州": "lhw", "连云港": "lyg", "洛阳": "lya",
            "丽江"  : "ljg", "芒市": "lum", "绵阳": "mig", "梅州": "mxz", "牡丹江": "mdg", "南宁": "nng", "南阳": "nny", "南京": "nkg",
            "南昌"  : "khn", "宁波": "ngb", "南通": "ntg", "南充": "nao", "青岛": "tao", "衢州": "juz", "庆阳": "iqn", "琼海": "bar",
            "泉州"  : "jjn", "日照": "riz", "沈阳": "she", "上饶": "sqd", "三明": "sqj", "邵阳": "wgn", "上海": "sha", "十堰": "wds",
            "石家庄" : "sjw", "三亚": "syx", "天津": "tsn", "太原": "tyn", "腾冲": "tcz", "唐山": "tvs", "铜仁": "ten", "台州": "hyn",
            "万州"  : "wxn", "乌兰浩特": "hlh", "威海": "weh", "温州": "wnz", "武汉": "wuh", "无锡": "wux", "武夷山": "wus", "潍坊": "wef",
            "乌鲁木齐": "urc", "襄阳": "xfn", "西双版纳": "jhg", "西昌": "xic", "兴义": "acx", "西宁": "xnn", "信阳": "xai", "西安": "sia",
            "徐州"  : "xuz", "玉林": "ylx", "宜春": "yic", "烟台": "ynt", "延吉": "ynj", "延安": "eny", "扬州": "yty", "榆林": "uyn",
            "银川"  : "inc", "宜昌": "yih", "盐城": "ynz", "运城": "ycu", "宜宾": "ybp", "义乌": "yiw", "郑州": "cgo", "遵义": "zyi",
            "舟山"  : "hsn", "张家界": "dyg", "湛江": "zha", "昭通": "zat"}},
    "成都"   : {
        "dcity": "ctu", "acityInfo": {
            "阿克苏" : "aku", "鞍山": "aog", "安庆": "aqg", "阿里": "ngq", "北京": "bjs", "北海": "bhy", "保山": "bsd", "毕节": "bfj",
            "包头"  : "bav", "巴中": "bzx", "百色": "aeb", "常州": "czx", "长沙": "csx", "昌都": "bpx", "长春": "cgq", "常德": "cgd",
            "承德"  : "cde", "沧源": "cwj", "敦煌": "dnh", "大同": "dat", "大连": "dlc", "迪庆": "dig", "稻城": "dcy", "东营": "doy",
            "大理"  : "dlu", "大庆": "dqa", "达州": "dax", "鄂尔多斯": "dsn", "恩施": "enh", "福州": "foc", "阜阳": "fug", "赣州": "kow",
            "桂林"  : "kwl", "贵阳": "kwe", "格尔木": "goq", "果洛": "gmq", "广州": "can", "甘孜": "gzg", "哈尔滨": "hrb", "红原": "ahj",
            "杭州"  : "hgh", "惠州": "huz", "合肥": "hfe", "衡阳": "hny", "哈密": "hmi", "淮安": "hia", "和田": "htn", "黄山": "txn",
            "呼和浩特": "het", "邯郸": "hdg", "海拉尔": "hld", "海口": "hak", "揭阳": "swa", "嘉峪关": "jgn", "九寨沟": "jzh", "济宁": "jng",
            "金昌"  : "jic", "井冈山": "jgs", "济南": "tna", "景德镇": "jdz", "库尔勒": "krl", "喀什": "khg", "克拉玛依": "kry",
            "库车"  : "kca", "康定": "kgt", "凯里": "kjh", "昆明": "kmg", "临沧": "lnj", "连云港": "lyg", "拉萨": "lxa", "洛阳": "lya",
            "丽江"  : "ljg", "林芝": "lzy", "吕梁": "llv", "兰州": "lhw", "六盘水": "lpf", "澜沧": "jmj", "柳州": "lzh", "临沂": "lyi",
            "芒市"  : "lum", "南京": "nkg", "南昌": "khn", "宁蒗": "nlh", "宁波": "ngb", "南通": "ntg", "南宁": "nng", "攀枝花": "pzi",
            "普洱"  : "sym", "齐齐哈尔": "ndg", "泉州": "jjn", "琼海": "bar", "青岛": "tao", "衢州": "juz", "黔江": "jiq", "日照": "riz",
            "日喀则" : "rkz", "三亚": "syx", "石家庄": "sjw", "石河子": "shf", "深圳": "szx", "上饶": "sqd", "十堰": "wds", "沈阳": "she",
            "上海"  : "sha", "太原": "tyn", "唐山": "tvs", "天津": "tsn", "铜仁": "ten", "台州": "hyn", "腾冲": "tcz", "梧州": "wuz",
            "温州"  : "wnz", "武夷山": "wus", "乌兰浩特": "hlh", "威海": "weh", "武汉": "wuh", "无锡": "wux", "文山": "wnh",
            "乌鲁木齐": "urc", "西安": "sia", "西双版纳": "jhg", "夏河": "gxh", "兴义": "acx", "襄阳": "xfn", "西昌": "xic", "厦门": "xmn",
            "信阳"  : "xai", "忻州": "wut", "西宁": "xnn", "徐州": "xuz", "扬州": "yty", "伊宁": "yin", "宜昌": "yih", "运城": "ycu",
            "盐城"  : "ynz", "烟台": "ynt", "延安": "eny", "玉树": "yus", "义乌": "yiw", "岳阳": "yya", "银川": "inc", "宜春": "yic",
            "张掖"  : "yzy", "张家界": "dyg", "湛江": "zha", "郑州": "cgo", "舟山": "hsn", "张家口": "zqz", "昭通": "zat", "中卫": "zhy",
            "珠海"  : "zuh", "遵义": "zyi"}},
    "杭州"   : {
        "dcity": "hgh", "acityInfo": {
            "安康"  : "aka", "阿克苏": "aku", "包头": "bav", "北京": "bjs", "保山": "bsd", "毕节": "bfj", "北海": "bhy", "长春": "cgq",
            "成都"  : "ctu", "长沙": "csx", "重庆": "ckg", "常德": "cgd", "承德": "cde", "赤峰": "cif", "大同": "dat", "达州": "dax",
            "敦煌"  : "dnh", "大连": "dlc", "东营": "doy", "恩施": "enh", "鄂尔多斯": "dsn", "贵阳": "kwe", "广元": "gys", "赣州": "kow",
            "广州"  : "can", "桂林": "kwl", "海拉尔": "hld", "海口": "hak", "邯郸": "hdg", "惠州": "huz", "哈尔滨": "hrb",
            "呼和浩特": "het", "衡阳": "hny", "怀化": "hjj", "汉中": "hzg", "佳木斯": "jmu", "嘉峪关": "jgn", "济南": "tna", "锦州": "jnz",
            "揭阳"  : "swa", "库尔勒": "krl", "昆明": "kmg", "凯里": "kjh", "临沂": "lyi", "兰州": "lhw", "吕梁": "llv", "丽江": "ljg",
            "拉萨"  : "lxa", "柳州": "lzh", "临汾": "lfq", "泸州": "lzo", "牡丹江": "mdg", "绵阳": "mig", "南充": "nao", "南宁": "nng",
            "秦皇岛" : "bpe", "黔江": "jiq", "青岛": "tao", "泉州": "jjn", "日照": "riz", "深圳": "szx", "十堰": "wds", "三亚": "syx",
            "石家庄" : "sjw", "沈阳": "she", "邵阳": "wgn", "腾冲": "tcz", "天水": "thq", "天津": "tsn", "通辽": "tgo", "太原": "tyn",
            "武汉"  : "wuh", "乌兰浩特": "hlh", "乌兰察布": "ucb", "乌鲁木齐": "urc", "潍坊": "wef", "万州": "wxn", "文山": "wnh",
            "威海"  : "weh", "温州": "wnz", "西双版纳": "jhg", "忻州": "wut", "西安": "sia", "厦门": "xmn", "信阳": "xai", "襄阳": "xfn",
            "兴义"  : "acx", "西宁": "xnn", "银川": "inc", "宜昌": "yih", "岳阳": "yya", "宜宾": "ybp", "烟台": "ynt", "榆林": "uyn",
            "延安"  : "eny", "延吉": "ynj", "盐城": "ynz", "玉林": "ylx", "运城": "ycu", "遵义": "zyi", "昭通": "zat", "张家界": "dyg",
            "郑州"  : "cgo", "珠海": "zuh", "湛江": "zha", "张家口": "zqz"}},
    "武汉"   : {
        "dcity": "wuh", "acityInfo": {
            "毕节" : "bfj", "北京": "bjs", "博乐": "bpl", "包头": "bav", "北海": "bhy", "成都": "ctu", "长治": "cih", "长春": "cgq",
            "重庆" : "ckg", "大同": "dat", "大连": "dlc", "大庆": "dqa", "大理": "dlu", "东营": "doy", "恩施": "enh", "福州": "foc",
            "贵阳" : "kwe", "赣州": "kow", "广州": "can", "海口": "hak", "淮安": "hia", "哈尔滨": "hrb", "呼和浩特": "het", "杭州": "hgh",
            "惠州" : "huz", "济南": "tna", "揭阳": "swa", "锦州": "jnz", "昆明": "kmg", "库尔勒": "krl", "连云港": "lyg", "临汾": "lfq",
            "柳州" : "lzh", "泸州": "lzo", "丽江": "ljg", "兰州": "lhw", "临沂": "lyi", "拉萨": "lxa", "绵阳": "mig", "南宁": "nng",
            "南通" : "ntg", "南充": "nao", "宁波": "ngb", "攀枝花": "pzi", "泉州": "jjn", "琼海": "bar", "衢州": "juz", "青岛": "tao",
            "日照" : "riz", "神农架": "hpg", "三亚": "syx", "沈阳": "she", "上海": "sha", "深圳": "szx", "太原": "tyn", "天津": "tsn",
            "腾冲" : "tcz", "台州": "hyn", "温州": "wnz", "乌鲁木齐": "urc", "西宁": "xnn", "厦门": "xmn", "西双版纳": "jhg", "兴义": "acx",
            "西昌" : "xic", "西安": "sia", "盐城": "ynz", "烟台": "ynt", "运城": "ycu", "榆林": "uyn", "银川": "inc", "义乌": "yiw",
            "张家界": "dyg", "珠海": "zuh", "湛江": "zha", "遵义": "zyi", "舟山": "hsn"}},
    "西安"   : {
        "dcity": "sia", "acityInfo": {
            "阿里": "ngq", "安庆": "aqg", "阿拉善左旗": "axf", "阿克苏": "aku", "阿勒泰": "aat", "北京": "bjs", "巴中": "bzx",
            "包头": "bav", "百色": "aeb", "毕节": "bfj", "北海": "bhy", "保山": "bsd", "赤峰": "cif", "承德": "cde", "常州": "czx",
            "常德": "cgd", "长春": "cgq", "成都": "ctu", "重庆": "ckg", "长沙": "csx", "昌都": "bpx", "大同": "dat", "敦煌": "dnh",
            "达州": "dax", "大连": "dlc", "东营": "doy", "大庆": "dqa", "额济纳旗": "ejn", "鄂尔多斯": "dsn", "恩施": "enh", "福州": "foc",
            "贵阳": "kwe", "赣州": "kow", "固原": "gyu", "桂林": "kwl", "广州": "can", "果洛": "gmq", "格尔木": "goq", "呼和浩特": "het",
            "淮安": "hia", "怀化": "hjj", "衡阳": "hny", "杭州": "hgh", "哈尔滨": "hrb", "黄山": "txn", "海口": "hak", "哈密": "hmi",
            "合肥": "hfe", "花土沟": "htt", "惠州": "huz", "汉中": "hzg", "和田": "htn", "揭阳": "swa", "嘉峪关": "jgn", "井冈山": "jgs",
            "济南": "tna", "景德镇": "jdz", "金昌": "jic", "昆明": "kmg", "库尔勒": "krl", "喀什": "khg", "库车": "kca", "克拉玛依": "kry",
            "林芝": "lzy", "泸州": "lzo", "陇南": "lnl", "拉萨": "lxa", "临沂": "lyi", "兰州": "lhw", "丽江": "ljg", "连云港": "lyg",
            "梅州": "mxz", "南昌": "khn", "南京": "nkg", "南宁": "nng", "南阳": "nny", "宁波": "ngb", "南通": "ntg", "衢州": "juz",
            "泉州": "jjn", "青岛": "tao", "日喀则": "rkz", "邵阳": "wgn", "沈阳": "she", "石家庄": "sjw", "莎车": "qsz", "上海": "sha",
            "深圳": "szx", "十堰": "wds", "三亚": "syx", "太原": "tyn", "通辽": "tgo", "天津": "tsn", "天水": "thq", "铜仁": "ten",
            "台州": "hyn", "腾冲": "tcz", "威海": "weh", "武夷山": "wus", "梧州": "wuz", "温州": "wnz", "乌海": "wua", "潍坊": "wef",
            "武汉": "wuh", "无锡": "wux", "乌鲁木齐": "urc", "兴义": "acx", "西双版纳": "jhg", "西宁": "xnn", "厦门": "xmn", "襄阳": "xfn",
            "信阳": "xai", "夏河": "gxh", "西昌": "xic", "伊宁": "yin", "烟台": "ynt", "宜昌": "yih", "银川": "inc", "延吉": "ynj",
            "延安": "eny", "玉林": "ylx", "榆林": "uyn", "扬州": "yty", "宜春": "yic", "玉树": "yus", "盐城": "ynz", "宜宾": "ybp",
            "义乌": "yiw", "张掖": "yzy", "珠海": "zuh", "遵义": "zyi", "中卫": "zhy", "昭通": "zat", "湛江": "zha", "张家界": "dyg"}},
    "重庆"   : {
        "dcity": "ckg", "acityInfo": {
            "阿勒泰": "aat", "安庆": "aqg", "阿克苏": "aku", "巴彦淖尔": "rlk", "博乐": "bpl", "北京": "bjs", "保山": "bsd", "包头": "bav",
            "百色" : "aeb", "毕节": "bfj", "北海": "bhy", "长治": "cih", "常州": "czx", "长春": "cgq", "昌都": "bpx", "长沙": "csx",
            "常德" : "cgd", "迪庆": "dig", "丹东": "ddg", "大连": "dlc", "稻城": "dcy", "大理": "dlu", "福州": "foc", "阜阳": "fug",
            "贵阳" : "kwe", "固原": "gyu", "赣州": "kow", "广州": "can", "桂林": "kwl", "淮安": "hia", "和田": "htn", "衡阳": "hny",
            "黄山" : "txn", "呼和浩特": "het", "哈尔滨": "hrb", "杭州": "hgh", "合肥": "hfe", "海口": "hak", "邯郸": "hdg", "惠州": "huz",
            "济宁" : "jng", "济南": "tna", "揭阳": "swa", "景德镇": "jdz", "喀什": "khg", "昆明": "kmg", "库尔勒": "krl", "澜沧": "jmj",
            "柳州" : "lzh", "荔波": "llb", "林芝": "lzy", "陇南": "lnl", "连云港": "lyg", "兰州": "lhw", "临沂": "lyi", "吕梁": "llv",
            "丽江" : "ljg", "拉萨": "lxa", "芒市": "lum", "梅州": "mxz", "南京": "nkg", "南昌": "khn", "南宁": "nng", "宁蒗": "nlh",
            "宁波" : "ngb", "南阳": "nny", "南通": "ntg", "攀枝花": "pzi", "琼海": "bar", "青岛": "tao", "衢州": "juz", "黔江": "jiq",
            "泉州" : "jjn", "日喀则": "rkz", "日照": "riz", "沈阳": "she", "邵阳": "wgn", "三明": "sqj", "深圳": "szx", "十堰": "wds",
            "上海" : "sha", "石家庄": "sjw", "上饶": "sqd", "莎车": "qsz", "三亚": "syx", "神农架": "hpg", "通化": "tnh", "天水": "thq",
            "太原" : "tyn", "台州": "hyn", "腾冲": "tcz", "天津": "tsn", "文山": "wnh", "乌海": "wua", "温州": "wnz", "威海": "weh",
            "巫山" : "wsk", "武汉": "wuh", "乌鲁木齐": "urc", "无锡": "wux", "潍坊": "wef", "襄阳": "xfn", "兴义": "acx", "西昌": "xic",
            "西宁" : "xnn", "西双版纳": "jhg", "厦门": "xmn", "忻州": "wut", "西安": "sia", "信阳": "xai", "徐州": "xuz", "宜春": "yic",
            "岳阳" : "yya", "义乌": "yiw", "运城": "ycu", "盐城": "ynz", "银川": "inc", "宜昌": "yih", "烟台": "ynt", "延安": "eny",
            "扬州" : "yty", "榆林": "uyn", "玉林": "ylx", "郑州": "cgo", "张家口": "zqz", "珠海": "zuh", "湛江": "zha", "舟山": "hsn",
            "张家界": "dyg", "中卫": "zhy", "昭通": "zat"}},
    "青岛"   : {
        "dcity": "tao", "acityInfo": {
            "安庆" : "aqg", "阿克苏": "aku", "白山": "nbs", "巴中": "bzx", "北京": "bjs", "长沙": "csx", "长春": "cgq", "重庆": "ckg",
            "成都" : "ctu", "赤峰": "cif", "常州": "czx", "丹东": "ddg", "大同": "dat", "大庆": "dqa", "大连": "dlc", "恩施": "enh",
            "阜阳" : "fug", "福州": "foc", "贵阳": "kwe", "赣州": "kow", "广州": "can", "桂林": "kwl", "杭州": "hgh", "呼和浩特": "het",
            "哈尔滨": "hrb", "合肥": "hfe", "邯郸": "hdg", "海口": "hak", "海拉尔": "hld", "黄山": "txn", "济宁": "jng", "金昌": "jic",
            "景德镇": "jdz", "揭阳": "swa", "建三江": "jsj", "佳木斯": "jmu", "鸡西": "jxa", "库尔勒": "krl", "昆明": "kmg", "陇南": "lnl",
            "洛阳" : "lya", "吕梁": "llv", "泸州": "lzo", "兰州": "lhw", "牡丹江": "mdg", "宁波": "ngb", "南通": "ntg", "南阳": "nny",
            "南宁" : "nng", "南京": "nkg", "南昌": "khn", "齐齐哈尔": "ndg", "黔江": "jiq", "衢州": "juz", "泉州": "jjn", "琼海": "bar",
            "深圳" : "szx", "上海": "sha", "上饶": "sqd", "三亚": "syx", "十堰": "wds", "沈阳": "she", "太原": "tyn", "武汉": "wuh",
            "无锡" : "wux", "武夷山": "wus", "乌鲁木齐": "urc", "西双版纳": "jhg", "厦门": "xmn", "信阳": "xai", "忻州": "wut",
            "西安" : "sia", "襄阳": "xfn", "兴义": "acx", "岳阳": "yya", "延吉": "ynj", "宜宾": "ybp", "义乌": "yiw", "银川": "inc",
            "运城" : "ycu", "郑州": "cgo", "遵义": "zyi", "珠海": "zuh", "舟山": "hsn"}},
    "长沙"   : {
        "dcity": "csx", "acityInfo": {
            "保山" : "bsd", "巴彦淖尔": "rlk", "北京": "bjs", "北海": "bhy", "百色": "aeb", "重庆": "ckg", "沧源": "cwj", "常州": "czx",
            "长春" : "cgq", "成都": "ctu", "大同": "dat", "大理": "dlu", "大庆": "dqa", "大连": "dlc", "鄂尔多斯": "dsn", "阜阳": "fug",
            "福州" : "foc", "贵阳": "kwe", "赣州": "kow", "广州": "can", "杭州": "hgh", "惠州": "huz", "河池": "hcj", "海口": "hak",
            "哈尔滨": "hrb", "淮安": "hia", "呼和浩特": "het", "济宁": "jng", "济南": "tna", "揭阳": "swa", "昆明": "kmg", "临沂": "lyi",
            "临沧" : "lnj", "黎平": "hzh", "兰州": "lhw", "连云港": "lyg", "丽江": "ljg", "吕梁": "llv", "荔波": "llb", "泸州": "lzo",
            "临汾" : "lfq", "绵阳": "mig", "芒市": "lum", "梅州": "mxz", "宁波": "ngb", "南宁": "nng", "南通": "ntg", "南京": "nkg",
            "南充" : "nao", "普洱": "sym", "青岛": "tao", "黔江": "jiq", "泉州": "jjn", "日照": "riz", "深圳": "szx", "上海": "sha",
            "十堰" : "wds", "三亚": "syx", "沈阳": "she", "石家庄": "sjw", "邵阳": "wgn", "天津": "tsn", "吐鲁番": "tlq", "台州": "hyn",
            "太原" : "tyn", "腾冲": "tcz", "无锡": "wux", "乌鲁木齐": "urc", "潍坊": "wef", "万州": "wxn", "文山": "wnh", "梧州": "wuz",
            "温州" : "wnz", "忻州": "wut", "厦门": "xmn", "徐州": "xuz", "西安": "sia", "西双版纳": "jhg", "西昌": "xic", "兴义": "acx",
            "西宁" : "xnn", "宜宾": "ybp", "榆林": "uyn", "延安": "eny", "银川": "inc", "盐城": "ynz", "运城": "ycu", "烟台": "ynt",
            "湛江" : "zha", "珠海": "zuh", "张家界": "dyg", "遵义": "zyi"}},
    "南京"   : {
        "dcity": "nkg", "acityInfo": {
            "鞍山" : "aog", "包头": "bav", "保山": "bsd", "北京": "bjs", "北海": "bhy", "毕节": "bfj", "长春": "cgq", "赤峰": "cif",
            "成都" : "ctu", "长沙": "csx", "重庆": "ckg", "常德": "cgd", "大理": "dlu", "大连": "dlc", "大同": "dat", "鄂尔多斯": "dsn",
            "恩施" : "enh", "福州": "foc", "贵阳": "kwe", "桂林": "kwl", "赣州": "kow", "广州": "can", "哈尔滨": "hrb", "汉中": "hzg",
            "衡阳" : "hny", "呼和浩特": "het", "海口": "hak", "惠州": "huz", "邯郸": "hdg", "井冈山": "jgs", "景德镇": "jdz", "揭阳": "swa",
            "佳木斯": "jmu", "嘉峪关": "jgn", "昆明": "kmg", "兰州": "lhw", "吕梁": "llv", "临汾": "lfq", "泸州": "lzo", "连云港": "lyg",
            "龙岩" : "lcx", "柳州": "lzh", "丽江": "ljg", "拉萨": "lxa", "芒市": "lum", "绵阳": "mig", "南宁": "nng", "南昌": "khn",
            "青岛" : "tao", "泉州": "jjn", "深圳": "szx", "十堰": "wds", "上海": "sha", "沈阳": "she", "三明": "sqj", "石家庄": "sjw",
            "三亚" : "syx", "腾冲": "tcz", "太原": "tyn", "天水": "thq", "万州": "wxn", "威海": "weh", "乌鲁木齐": "urc", "武夷山": "wus",
            "梧州" : "wuz", "忻州": "wut", "西宁": "xnn", "西昌": "xic", "西双版纳": "jhg", "兴义": "acx", "厦门": "xmn", "西安": "sia",
            "银川" : "inc", "榆林": "uyn", "宜宾": "ybp", "烟台": "ynt", "延安": "eny", "运城": "ycu", "伊宁": "yin", "宜春": "yic",
            "营口" : "ykh", "张家界": "dyg", "遵义": "zyi", "郑州": "cgo", "珠海": "zuh", "湛江": "zha"}},
    "厦门"   : {
        "dcity": "xmn", "acityInfo": {
            "安庆" : "aqg", "北京": "bjs", "包头": "bav", "毕节": "bfj", "承德": "cde", "常州": "czx", "长春": "cgq", "成都": "ctu",
            "重庆" : "ckg", "长治": "cih", "长沙": "csx", "大连": "dlc", "大同": "dat", "东营": "doy", "恩施": "enh", "鄂尔多斯": "dsn",
            "阜阳" : "fug", "福州": "foc", "贵阳": "kwe", "广州": "can", "桂林": "kwl", "赣州": "kow", "哈尔滨": "hrb", "海口": "hak",
            "淮安" : "hia", "黄山": "txn", "衡阳": "hny", "杭州": "hgh", "合肥": "hfe", "呼和浩特": "het", "景德镇": "jdz", "济南": "tna",
            "井冈山": "jgs", "济宁": "jng", "昆明": "kmg", "柳州": "lzh", "泸州": "lzo", "兰州": "lhw", "临沂": "lyi", "丽江": "ljg",
            "连云港": "lyg", "绵阳": "mig", "南京": "nkg", "南昌": "khn", "南宁": "nng", "南阳": "nny", "南充": "nao", "南通": "ntg",
            "宁波" : "ngb", "青岛": "tao", "秦皇岛": "bpe", "石家庄": "sjw", "沈阳": "she", "上饶": "sqd", "上海": "sha", "十堰": "wds",
            "三亚" : "syx", "铜仁": "ten", "太原": "tyn", "天津": "tsn", "唐山": "tvs", "武夷山": "wus", "万州": "wxn", "无锡": "wux",
            "武汉" : "wuh", "乌鲁木齐": "urc", "潍坊": "wef", "西昌": "xic", "襄阳": "xfn", "西宁": "xnn", "徐州": "xuz", "西安": "sia",
            "忻州" : "wut", "运城": "ycu", "宜春": "yic", "岳阳": "yya", "烟台": "ynt", "银川": "inc", "扬州": "yty", "盐城": "ynz",
            "宜宾" : "ybp", "郑州": "cgo", "遵义": "zyi", "珠海": "zuh", "舟山": "hsn", "张家口": "zqz", "湛江": "zha"}},
    "昆明"   : {
        "dcity": "kmg", "acityInfo": {
            "安庆" : "aqg", "阿克苏": "aku", "北海": "bhy", "包头": "bav", "毕节": "bfj", "保山": "bsd", "北京": "bjs", "白山": "nbs",
            "巴中" : "bzx", "成都": "ctu", "长春": "cgq", "重庆": "ckg", "长沙": "csx", "长治": "cih", "常州": "czx", "沧源": "cwj",
            "大理" : "dlu", "迪庆": "dig", "大同": "dat", "达州": "dax", "东营": "doy", "大连": "dlc", "鄂尔多斯": "dsn", "恩施": "enh",
            "福州" : "foc", "佛山": "fuo", "阜阳": "fug", "赣州": "kow", "桂林": "kwl", "广元": "gys", "广州": "can", "衡阳": "hny",
            "惠州" : "huz", "合肥": "hfe", "淮安": "hia", "呼和浩特": "het", "海口": "hak", "杭州": "hgh", "邯郸": "hdg", "海拉尔": "hld",
            "黄山" : "txn", "哈尔滨": "hrb", "锦州": "jnz", "揭阳": "swa", "济南": "tna", "景德镇": "jdz", "济宁": "jng", "井冈山": "jgs",
            "库尔勒": "krl", "拉萨": "lxa", "丽江": "ljg", "临汾": "lfq", "泸州": "lzo", "兰州": "lhw", "临沂": "lyi", "柳州": "lzh",
            "澜沧" : "jmj", "临沧": "lnj", "洛阳": "lya", "连云港": "lyg", "龙岩": "lcx", "芒市": "lum", "绵阳": "mig", "梅州": "mxz",
            "南充" : "nao", "宁波": "ngb", "南通": "ntg", "宁蒗": "nlh", "南昌": "khn", "南京": "nkg", "南宁": "nng", "普洱": "sym",
            "黔江" : "jiq", "齐齐哈尔": "ndg", "衢州": "juz", "泉州": "jjn", "青岛": "tao", "日照": "riz", "上饶": "sqd", "上海": "sha",
            "深圳" : "szx", "沈阳": "she", "十堰": "wds", "三亚": "syx", "邵阳": "wgn", "石家庄": "sjw", "台州": "hyn", "天津": "tsn",
            "太原" : "tyn", "唐山": "tvs", "腾冲": "tcz", "无锡": "wux", "武汉": "wuh", "乌鲁木齐": "urc", "文山": "wnh", "万州": "wxn",
            "温州" : "wnz", "西宁": "xnn", "徐州": "xuz", "西昌": "xic", "西双版纳": "jhg", "厦门": "xmn", "信阳": "xai", "西安": "sia",
            "兴义" : "acx", "襄阳": "xfn", "宜宾": "ybp", "银川": "inc", "盐城": "ynz", "岳阳": "yya", "义乌": "yiw", "运城": "ycu",
            "宜春" : "yic", "烟台": "ynt", "榆林": "uyn", "扬州": "yty", "玉林": "ylx", "宜昌": "yih", "昭通": "zat", "珠海": "zuh",
            "郑州" : "cgo", "张家界": "dyg", "湛江": "zha"}},
    "大连"   : {
        "dcity": "dlc", "acityInfo": {
            "白城" : "dbc", "北京": "bjs", "包头": "bav", "长沙": "csx", "赤峰": "cif", "重庆": "ckg", "成都": "ctu", "常州": "czx",
            "东营" : "doy", "大庆": "dqa", "恩施": "enh", "福州": "foc", "阜阳": "fug", "贵阳": "kwe", "广州": "can", "惠州": "huz",
            "合肥" : "hfe", "衡阳": "hny", "杭州": "hgh", "淮安": "hia", "邯郸": "hdg", "海口": "hak", "呼和浩特": "het", "黄山": "txn",
            "建三江": "jsj", "佳木斯": "jmu", "揭阳": "swa", "加格达奇": "jgd", "济南": "tna", "济宁": "jng", "鸡西": "jxa", "景德镇": "jdz",
            "昆明" : "kmg", "吕梁": "llv", "临汾": "lfq", "洛阳": "lya", "临沂": "lyi", "连云港": "lyg", "牡丹江": "mdg", "南京": "nkg",
            "南昌" : "khn", "南宁": "nng", "南通": "ntg", "宁波": "ngb", "衢州": "juz", "青岛": "tao", "齐齐哈尔": "ndg", "泉州": "jjn",
            "琼海" : "bar", "日照": "riz", "上海": "sha", "深圳": "szx", "三亚": "syx", "十堰": "wds", "天津": "tsn", "通化": "tnh",
            "台州" : "hyn", "无锡": "wux", "潍坊": "wef", "乌鲁木齐": "urc", "武汉": "wuh", "温州": "wnz", "威海": "weh", "徐州": "xuz",
            "西安" : "sia", "厦门": "xmn", "烟台": "ynt", "榆林": "uyn", "盐城": "ynz", "伊春": "lds", "延吉": "ynj", "宜春": "yic",
            "扬州" : "yty", "运城": "ycu", "舟山": "hsn", "郑州": "cgo", "遵义": "zyi", "珠海": "zuh", "湛江": "zha"}},
    "天津"   : {
        "dcity": "tsn", "acityInfo": {
            "安庆": "aqg", "白城": "dbc", "北京": "bjs", "包头": "bav", "北海": "bhy", "白山": "nbs", "赤峰": "cif", "长治": "cih",
            "长沙": "csx", "重庆": "ckg", "常德": "cgd", "成都": "ctu", "长春": "cgq", "昌都": "bpx", "承德": "cde", "朝阳": "chg",
            "大同": "dat", "大庆": "dqa", "大连": "dlc", "东营": "doy", "恩施": "enh", "阜阳": "fug", "福州": "foc", "固原": "gyu",
            "贵阳": "kwe", "桂林": "kwl", "广州": "can", "杭州": "hgh", "海口": "hak", "哈尔滨": "hrb", "呼和浩特": "het", "海拉尔": "hld",
            "鸡西": "jxa", "景德镇": "jdz", "揭阳": "swa", "昆明": "kmg", "洛阳": "lya", "连云港": "lyg", "兰州": "lhw", "临沂": "lyi",
            "吕梁": "llv", "龙岩": "lcx", "泸州": "lzo", "临汾": "lfq", "满洲里": "nzh", "芒市": "lum", "绵阳": "mig", "南昌": "khn",
            "南通": "ntg", "南阳": "nny", "宁波": "ngb", "南宁": "nng", "庆阳": "iqn", "齐齐哈尔": "ndg", "泉州": "jjn", "日照": "riz",
            "深圳": "szx", "上海": "sha", "十堰": "wds", "三亚": "syx", "太原": "tyn", "通化": "tnh", "天水": "thq", "乌海": "wua",
            "武汉": "wuh", "乌兰浩特": "hlh", "乌鲁木齐": "urc", "万州": "wxn", "温州": "wnz", "西双版纳": "jhg", "西昌": "xic",
            "夏河": "gxh", "忻州": "wut", "厦门": "xmn", "西安": "sia", "襄阳": "xfn", "西宁": "xnn", "义乌": "yiw", "运城": "ycu",
            "银川": "inc", "宜宾": "ybp", "宜昌": "yih", "榆林": "uyn", "烟台": "ynt", "遵义": "zyi", "舟山": "hsn", "珠海": "zuh",
            "湛江": "zha", "扎兰屯": "nzl"}},
    "郑州"   : {
        "dcity": "cgo", "acityInfo": {
            "阿克苏" : "aku", "北海": "bhy", "巴彦淖尔": "rlk", "北京": "bjs", "毕节": "bfj", "包头": "bav", "赤峰": "cif", "长春": "cgq",
            "重庆"  : "ckg", "成都": "ctu", "大同": "dat", "大连": "dlc", "东营": "doy", "大理": "dlu", "达州": "dax", "恩施": "enh",
            "鄂尔多斯": "dsn", "福州": "foc", "贵阳": "kwe", "赣州": "kow", "广州": "can", "格尔木": "goq", "桂林": "kwl", "哈尔滨": "hrb",
            "杭州"  : "hgh", "黑河": "hek", "呼和浩特": "het", "哈密": "hmi", "海口": "hak", "惠州": "huz", "揭阳": "swa", "喀什": "khg",
            "库尔勒" : "krl", "昆明": "kmg", "克拉玛依": "kry", "临沂": "lyi", "泸州": "lzo", "澜沧": "jmj", "柳州": "lzh", "临沧": "lnj",
            "吕梁"  : "llv", "丽江": "ljg", "拉萨": "lxa", "兰州": "lhw", "芒市": "lum", "绵阳": "mig", "宁波": "ngb", "南宁": "nng",
            "南通"  : "ntg", "南昌": "khn", "南京": "nkg", "青岛": "tao", "黔江": "jiq", "泉州": "jjn", "琼海": "bar", "若羌": "rqa",
            "深圳"  : "szx", "上海": "sha", "石河子": "shf", "沈阳": "she", "邵阳": "wgn", "三明": "sqj", "三亚": "syx", "腾冲": "tcz",
            "铜仁"  : "ten", "台州": "hyn", "万州": "wxn", "乌海": "wua", "温州": "wnz", "乌鲁木齐": "urc", "乌兰察布": "ucb",
            "厦门"  : "xmn", "西宁": "xnn", "西双版纳": "jhg", "兴义": "acx", "烟台": "ynt", "延安": "eny", "榆林": "uyn", "玉林": "ylx",
            "义乌"  : "yiw", "银川": "inc", "珠海": "zuh", "遵义": "zyi", "张家界": "dyg", "湛江": "zha", "舟山": "hsn"}},
    "三亚"   : {
        "dcity": "syx", "acityInfo": {
            "北京"  : "bjs", "重庆": "ckg", "长沙": "csx", "成都": "ctu", "长春": "cgq", "东营": "doy", "大连": "dlc", "大庆": "dqa",
            "鄂尔多斯": "dsn", "阜阳": "fug", "福州": "foc", "桂林": "kwl", "赣州": "kow", "广州": "can", "贵阳": "kwe", "呼和浩特": "het",
            "合肥"  : "hfe", "衡阳": "hny", "哈尔滨": "hrb", "杭州": "hgh", "怀化": "hjj", "揭阳": "swa", "济南": "tna", "鸡西": "jxa",
            "济宁"  : "jng", "昆明": "kmg", "泸州": "lzo", "洛阳": "lya", "兰州": "lhw", "临沂": "lyi", "柳州": "lzh", "绵阳": "mig",
            "南宁"  : "nng", "南通": "ntg", "宁波": "ngb", "南昌": "khn", "南京": "nkg", "衢州": "juz", "青岛": "tao", "上海": "sha",
            "石家庄" : "sjw", "十堰": "wds", "上饶": "sqd", "沈阳": "she", "深圳": "szx", "天津": "tsn", "太原": "tyn", "温州": "wnz",
            "乌鲁木齐": "urc", "梧州": "wuz", "潍坊": "wef", "无锡": "wux", "武汉": "wuh", "厦门": "xmn", "西安": "sia", "徐州": "xuz",
            "西宁"  : "xnn", "兴义": "acx", "襄阳": "xfn", "延安": "eny", "宜宾": "ybp", "义乌": "yiw", "银川": "inc", "盐城": "ynz",
            "宜春"  : "yic", "烟台": "ynt", "榆林": "uyn", "扬州": "yty", "运城": "ycu", "珠海": "zuh", "湛江": "zha", "郑州": "cgo",
            "遵义"  : "zyi"}},
    "济南"   : {
        "dcity": "tna", "acityInfo": {
            "阿克苏" : "aku", "常德": "cgd", "长春": "cgq", "长沙": "csx", "成都": "ctu", "重庆": "ckg", "大连": "dlc", "大同": "dat",
            "鄂尔多斯": "dsn", "福州": "foc", "广州": "can", "贵阳": "kwe", "广元": "gys", "桂林": "kwl", "赣州": "kow", "哈尔滨": "hrb",
            "怀化"  : "hjj", "衡阳": "hny", "杭州": "hgh", "呼和浩特": "het", "海口": "hak", "惠州": "huz", "佳木斯": "jmu", "揭阳": "swa",
            "昆明"  : "kmg", "凯里": "kjh", "库尔勒": "krl", "喀什": "khg", "荔波": "llb", "柳州": "lzh", "泸州": "lzo", "兰州": "lhw",
            "丽江"  : "ljg", "拉萨": "lxa", "牡丹江": "mdg", "绵阳": "mig", "南阳": "nny", "南昌": "khn", "南宁": "nng", "南通": "ntg",
            "衢州"  : "juz", "齐齐哈尔": "ndg", "琼海": "bar", "泉州": "jjn", "日喀则": "rkz", "沈阳": "she", "上海": "sha", "十堰": "wds",
            "上饶"  : "sqd", "深圳": "szx", "三亚": "syx", "台州": "hyn", "铜仁": "ten", "威海": "weh", "万州": "wxn", "武汉": "wuh",
            "温州"  : "wnz", "乌鲁木齐": "urc", "襄阳": "xfn", "兴义": "acx", "西宁": "xnn", "厦门": "xmn", "信阳": "xai", "西安": "sia",
            "运城"  : "ycu", "榆林": "uyn", "银川": "inc", "烟台": "ynt", "义乌": "yiw", "宜昌": "yih", "张家界": "dyg", "珠海": "zuh",
            "湛江"  : "zha", "舟山": "hsn"}},
    "福州"   : {
        "dcity": "foc", "acityInfo": {
            "安庆"  : "aqg", "北京": "bjs", "包头": "bav", "北海": "bhy", "成都": "ctu", "长沙": "csx", "长春": "cgq", "常州": "czx",
            "重庆"  : "ckg", "大连": "dlc", "恩施": "enh", "固原": "gyu", "贵阳": "kwe", "桂林": "kwl", "广州": "can", "衡阳": "hny",
            "呼和浩特": "het", "淮安": "hia", "哈尔滨": "hrb", "海口": "hak", "济南": "tna", "昆明": "kmg", "泸州": "lzo", "丽江": "ljg",
            "洛阳"  : "lya", "连云港": "lyg", "兰州": "lhw", "柳州": "lzh", "临沂": "lyi", "拉萨": "lxa", "绵阳": "mig", "南通": "ntg",
            "南宁"  : "nng", "南京": "nkg", "南阳": "nny", "南充": "nao", "琼海": "bar", "青岛": "tao", "日照": "riz", "上海": "sha",
            "深圳"  : "szx", "沈阳": "she", "石家庄": "sjw", "三亚": "syx", "天津": "tsn", "太原": "tyn", "铜仁": "ten", "梧州": "wuz",
            "无锡"  : "wux", "万州": "wxn", "武汉": "wuh", "乌鲁木齐": "urc", "西安": "sia", "厦门": "xmn", "兴义": "acx", "襄阳": "xfn",
            "西宁"  : "xnn", "徐州": "xuz", "宜宾": "ybp", "延安": "eny", "运城": "ycu", "宜春": "yic", "烟台": "ynt", "宜昌": "yih",
            "银川"  : "inc", "岳阳": "yya", "珠海": "zuh", "郑州": "cgo", "遵义": "zyi", "中卫": "zhy", "舟山": "hsn"}},
    "阿勒泰"  : {
        "dcity": "aat", "acityInfo": {
            "阿克苏": "aku", "布尔津": "kji", "博乐": "bpl", "重庆": "ckg", "塔城": "tcg", "富蕴": "fyn", "乌鲁木齐": "urc", "西安": "sia",
            "和田" : "htn", "伊宁": "yin", "库尔勒": "krl", "克拉玛依": "kry"}},
    "阿克苏"  : {
        "dcity": "aku", "acityInfo": {
            "阿勒泰": "aat", "博乐": "bpl", "北京": "bjs", "成都": "ctu", "重庆": "ckg", "杭州": "hgh", "哈密": "hmi", "呼和浩特": "het",
            "和田" : "htn", "合肥": "hfe", "昆明": "kmg", "喀什": "khg", "库尔勒": "krl", "库车": "kca", "兰州": "lhw", "宁波": "ngb",
            "泉州" : "jjn", "青岛": "tao", "石河子": "shf", "莎车": "qsz", "三亚": "syx", "上海": "sha", "深圳": "szx", "图木舒克": "twc",
            "吐鲁番": "tlq", "塔城": "tcg", "无锡": "wux", "乌鲁木齐": "urc", "西安": "sia", "西宁": "xnn", "伊宁": "yin", "义乌": "yiw",
            "扬州" : "yty", "郑州": "cgo"}},
    "鞍山"   : {"dcity": "aog", "acityInfo": {"北京": "bjs", "成都": "ctu", "上海": "sha", "南京": "nkg", "广州": "can"}},
    "安庆"   : {
        "dcity": "aqg", "acityInfo": {
            "青岛": "tao", "北京": "bjs", "深圳": "szx", "重庆": "ckg", "成都": "ctu", "天津": "tsn", "福州": "foc", "广州": "can",
            "西安": "sia", "厦门": "xmn", "海口": "hak", "昆明": "kmg", "宁波": "ngb"}},
    "阿拉善左旗": {"dcity": "axf", "acityInfo": {"呼和浩特": "het", "西安": "sia", "阿拉善右旗": "rht", "额济纳旗": "ejn"}},
    "阿里"   : {"dcity": "ngq", "acityInfo": {"西安": "sia", "成都": "ctu", "拉萨": "lxa"}},
    "阿拉善右旗": {"dcity": "rht", "acityInfo": {"阿拉善左旗": "axf"}},
    "阿尔山"  : {"dcity": "yie", "acityInfo": {"哈尔滨": "hrb", "呼和浩特": "het", "北京": "bjs", "二连浩特": "erl", "乌兰浩特": "hlh"}},
    "巴中"   : {
        "dcity": "bzx", "acityInfo": {
            "青岛": "tao", "北京": "bjs", "深圳": "szx", "上海": "sha", "成都": "ctu", "广州": "can", "温州": "wnz", "海口": "hak",
            "西安": "sia", "昆明": "kmg"}},
    "百色"   : {
        "dcity": "aeb", "acityInfo": {
            "北京": "bjs", "成都": "ctu", "重庆": "ckg", "长沙": "csx", "深圳": "szx", "上海": "sha", "广州": "can", "海口": "hak",
            "西安": "sia"}},
    "包头"   : {
        "dcity": "bav", "acityInfo": {
            "北京": "bjs", "重庆": "ckg", "成都": "ctu", "赤峰": "cif", "大连": "dlc", "福州": "foc", "贵阳": "kwe", "广州": "can",
            "杭州": "hgh", "昆明": "kmg", "南京": "nkg", "深圳": "szx", "沈阳": "she", "上海": "sha", "太原": "tyn", "天津": "tsn",
            "武汉": "wuh", "西安": "sia", "厦门": "xmn", "忻州": "wut", "烟台": "ynt", "郑州": "cgo"}},
    "毕节"   : {
        "dcity": "bfj", "acityInfo": {
            "北京": "bjs", "成都": "ctu", "重庆": "ckg", "福州": "foc", "贵阳": "kwe", "广州": "can", "海口": "hak", "杭州": "hgh",
            "淮安": "hia", "合肥": "hfe", "济宁": "jng", "济南": "tna", "昆明": "kmg", "丽江": "ljg", "澜沧": "jmj", "宁波": "ngb",
            "南京": "nkg", "泉州": "jjn", "黔江": "jiq", "上海": "sha", "天津": "tsn", "武汉": "wuh", "温州": "wnz", "厦门": "xmn",
            "西宁": "xnn", "西安": "sia", "西双版纳": "jhg", "兴义": "acx", "义乌": "yiw", "郑州": "cgo"}},
    "北海"   : {
        "dcity": "bhy", "acityInfo": {
            "阿克苏": "aku", "北京": "bjs", "成都": "ctu", "长治": "cih", "重庆": "ckg", "长沙": "csx", "福州": "foc", "桂林": "kwl",
            "贵阳" : "kwe", "广州": "can", "衡阳": "hny", "合肥": "hfe", "淮安": "hia", "杭州": "hgh", "哈尔滨": "hrb", "济宁": "jng",
            "昆明" : "kmg", "绵阳": "mig", "南京": "nkg", "琼海": "bar", "石家庄": "sjw", "上海": "sha", "深圳": "szx", "天津": "tsn",
            "武汉" : "wuh", "西安": "sia", "扬州": "yty", "义乌": "yiw", "郑州": "cgo"}},
    "博乐"   : {
        "dcity": "bpl", "acityInfo": {
            "阿勒泰" : "aat", "阿克苏": "aku", "喀什": "khg", "库尔勒": "krl", "克拉玛依": "kry", "塔城": "tcg", "武汉": "wuh",
            "乌鲁木齐": "urc"}},
    "保山"   : {
        "dcity": "bsd", "acityInfo": {
            "北京": "bjs", "长沙": "csx", "重庆": "ckg", "成都": "ctu", "贵阳": "kwe", "广州": "can", "杭州": "hgh", "昆明": "kmg",
            "澜沧": "jmj", "南宁": "nng", "南京": "nkg", "普洱": "sym", "上海": "sha", "文山": "wnh", "西安": "sia", "西双版纳": "jhg",
            "昭通": "zat", "珠海": "zuh"}},
    "白城"   : {"dcity": "dbc", "acityInfo": {"北京": "bjs", "大连": "dlc", "天津": "tsn"}},
    "布尔津"  : {"dcity": "kji", "acityInfo": {"阿勒泰": "aat", "富蕴": "fyn"}},
    "白山"   : {"dcity": "nbs", "acityInfo": {"青岛": "tao", "北京": "bjs", "上海": "sha", "昆明": "kmg", "天津": "tsn"}},
    "巴彦淖尔" : {"dcity": "rlk", "acityInfo": {"呼和浩特": "het", "北京": "bjs", "郑州": "cgo", "上海": "sha", "重庆": "ckg"}},
    "昌都"   : {
        "dcity"    : "bpx",
        "acityInfo": {"西安": "sia", "深圳": "szx", "重庆": "ckg", "成都": "ctu", "天津": "tsn", "拉萨": "lxa"}},
    "承德"   : {
        "dcity": "cde", "acityInfo": {
            "上海": "sha", "石家庄": "sjw", "成都": "ctu", "天津": "tsn", "广州": "can", "杭州": "hgh", "厦门": "xmn", "西安": "sia"}},
    "常德"   : {
        "dcity": "cgd", "acityInfo": {
            "北京": "bjs", "重庆": "ckg", "成都": "ctu", "广州": "can", "杭州": "hgh", "惠州": "huz", "海口": "hak", "济南": "tna",
            "昆明": "kmg", "南宁": "nng", "南京": "nkg", "泉州": "jjn", "深圳": "szx", "天津": "tsn", "温州": "wnz", "西安": "sia",
            "珠海": "zuh"}},
    "长春"   : {
        "dcity": "cgq", "acityInfo": {
            "北京"  : "bjs", "成都": "ctu", "常州": "czx", "长沙": "csx", "重庆": "ckg", "东营": "doy", "大同": "dat", "鄂尔多斯": "dsn",
            "福州"  : "foc", "广州": "can", "贵阳": "kwe", "桂林": "kwl", "合肥": "hfe", "淮安": "hia", "海口": "hak", "呼和浩特": "het",
            "杭州"  : "hgh", "济南": "tna", "揭阳": "swa", "昆明": "kmg", "兰州": "lhw", "连云港": "lyg", "临沂": "lyi", "临汾": "lfq",
            "南昌"  : "khn", "南京": "nkg", "南宁": "nng", "宁波": "ngb", "南通": "ntg", "泉州": "jjn", "青岛": "tao", "日照": "riz",
            "上海"  : "sha", "深圳": "szx", "三亚": "syx", "石家庄": "sjw", "天津": "tsn", "太原": "tyn", "武汉": "wuh", "温州": "wnz",
            "乌鲁木齐": "urc", "威海": "weh", "潍坊": "wef", "无锡": "wux", "徐州": "xuz", "厦门": "xmn", "西安": "sia", "烟台": "ynt",
            "银川"  : "inc", "运城": "ycu", "盐城": "ynz", "延吉": "ynj", "扬州": "yty", "义乌": "yiw", "郑州": "cgo", "珠海": "zuh"}},
    "朝阳"   : {"dcity": "chg", "acityInfo": {"北京": "bjs", "上海": "sha", "天津": "tsn"}},
    "赤峰"   : {
        "dcity": "cif", "acityInfo": {
            "青岛" : "tao", "包头": "bav", "北京": "bjs", "上海": "sha", "深圳": "szx", "天津": "tsn", "大连": "dlc", "二连浩特": "erl",
            "哈尔滨": "hrb", "海拉尔": "hld", "杭州": "hgh", "呼和浩特": "het", "西安": "sia", "郑州": "cgo", "南京": "nkg"}},
    "长治"   : {
        "dcity": "cih", "acityInfo": {
            "北京": "bjs", "北海": "bhy", "重庆": "ckg", "成都": "ctu", "上海": "sha", "沈阳": "she", "天津": "tsn", "太原": "tyn",
            "桂林": "kwl", "广州": "can", "武汉": "wuh", "杭州": "hgh", "厦门": "xmn", "银川": "inc", "拉萨": "lxa", "南昌": "khn"}},
    "沧源"   : {"dcity": "cwj", "acityInfo": {"成都": "ctu", "长沙": "csx", "上海": "sha", "昆明": "kmg", "丽江": "ljg"}},
    "常州"   : {
        "dcity": "czx", "acityInfo": {
            "北京": "bjs", "长春": "cgq", "成都": "ctu", "重庆": "ckg", "长沙": "csx", "大连": "dlc", "福州": "foc", "广州": "can",
            "贵阳": "kwe", "赣州": "kow", "海口": "hak", "哈尔滨": "hrb", "昆明": "kmg", "南宁": "nng", "泉州": "jjn", "青岛": "tao",
            "深圳": "szx", "沈阳": "she", "太原": "tyn", "厦门": "xmn", "西安": "sia", "烟台": "ynt", "珠海": "zuh"}},
    "池州"   : {"dcity": "juh", "acityInfo": {"深圳": "szx", "广州": "can"}},
    "潮州"   : {
        "dcity": "swa", "acityInfo": {
            "北京": "bjs", "巴彦淖尔": "rlk", "长春": "cgq", "成都": "ctu", "重庆": "ckg", "长沙": "csx", "大连": "dlc", "广州": "can",
            "桂林": "kwl", "贵阳": "kwe", "合肥": "hfe", "哈尔滨": "hrb", "海口": "hak", "杭州": "hgh", "济南": "tna", "昆明": "kmg",
            "拉萨": "lxa", "临沂": "lyi", "泸州": "lzo", "柳州": "lzh", "芒市": "lum", "绵阳": "mig", "南京": "nkg", "南昌": "khn",
            "南宁": "nng", "宁波": "ngb", "南阳": "nny", "青岛": "tao", "上海": "sha", "邵阳": "wgn", "三亚": "syx", "沈阳": "she",
            "太原": "tyn", "天津": "tsn", "乌鲁木齐": "urc", "武汉": "wuh", "西安": "sia", "徐州": "xuz", "义乌": "yiw", "岳阳": "yya",
            "宜昌": "yih", "盐城": "ynz", "郑州": "cgo", "舟山": "hsn", "珠海": "zuh"}},
    "大同"   : {
        "dcity": "dat", "acityInfo": {
            "长沙": "csx", "成都": "ctu", "长春": "cgq", "广州": "can", "海口": "hak", "杭州": "hgh", "合肥": "hfe", "哈尔滨": "hrb",
            "济南": "tna", "昆明": "kmg", "兰州": "lhw", "南京": "nkg", "青岛": "tao", "秦皇岛": "bpe", "上海": "sha", "深圳": "szx",
            "沈阳": "she", "太原": "tyn", "天津": "tsn", "武汉": "wuh", "西安": "sia", "厦门": "xmn", "银川": "inc", "郑州": "cgo"}},
    "达县"   : {
        "dcity": "dax", "acityInfo": {
            "泉州": "jjn", "北京": "bjs", "上海": "sha", "深圳": "szx", "成都": "ctu", "广州": "can", "贵阳": "kwe", "杭州": "hgh",
            "海口": "hak", "西安": "sia", "珠海": "zuh", "郑州": "cgo", "昆明": "kmg", "拉萨": "lxa", "南宁": "nng"}},
    "稻城"   : {"dcity": "dcy", "acityInfo": {"珠海": "zuh", "重庆": "ckg", "成都": "ctu", "广州": "can"}},
    "丹东"   : {
        "dcity": "ddg", "acityInfo": {
            "青岛": "tao", "北京": "bjs", "深圳": "szx", "上海": "sha", "重庆": "ckg", "威海": "weh", "扬州": "yty", "烟台": "ynt"}},
    "迪庆"   : {
        "dcity": "dig", "acityInfo": {
            "上海": "sha", "深圳": "szx", "成都": "ctu", "重庆": "ckg", "广州": "can", "西双版纳": "jhg", "昆明": "kmg", "拉萨": "lxa"}},
    "大理"   : {
        "dcity": "dlu", "acityInfo": {
            "北京": "bjs", "长沙": "csx", "重庆": "ckg", "成都": "ctu", "贵阳": "kwe", "广州": "can", "合肥": "hfe", "昆明": "kmg",
            "泸州": "lzo", "芒市": "lum", "绵阳": "mig", "南京": "nkg", "衢州": "juz", "上海": "sha", "邵阳": "wgn", "深圳": "szx",
            "武汉": "wuh", "襄阳": "xfn", "西双版纳": "jhg", "郑州": "cgo"}},
    "敦煌"   : {
        "dcity": "dnh", "acityInfo": {
            "北京": "bjs", "成都": "ctu", "上海": "sha", "杭州": "hgh", "花土沟": "htt", "西安": "sia", "兰州": "lhw"}},
    "东营"   : {
        "dcity": "doy", "acityInfo": {
            "北京": "bjs", "长春": "cgq", "成都": "ctu", "上海": "sha", "三亚": "syx", "大连": "dlc", "天津": "tsn", "广州": "can",
            "武汉": "wuh", "乌鲁木齐": "urc", "西安": "sia", "厦门": "xmn", "杭州": "hgh", "郑州": "cgo", "昆明": "kmg"}},
    "大庆"   : {
        "dcity": "dqa", "acityInfo": {
            "青岛": "tao", "北京": "bjs", "上海": "sha", "三亚": "syx", "沈阳": "she", "深圳": "szx", "长沙": "csx", "成都": "ctu",
            "大连": "dlc", "天津": "tsn", "广州": "can", "威海": "weh", "武汉": "wuh", "西安": "sia", "烟台": "ynt"}},
    "德令哈"  : {"dcity": "hxd", "acityInfo": {"西宁": "xnn"}},
    "德宏"   : {
        "dcity": "lum", "acityInfo": {
            "北京": "bjs", "长沙": "csx", "重庆": "ckg", "成都": "ctu", "大理": "dlu", "贵阳": "kwe", "广州": "can", "揭阳": "swa",
            "昆明": "kmg", "澜沧": "jmj", "南京": "nkg", "南昌": "khn", "普洱": "sym", "泉州": "jjn", "深圳": "szx", "上海": "sha",
            "天津": "tsn", "文山": "wnh", "西双版纳": "jhg", "扬州": "yty", "郑州": "cgo"}},
    "鄂尔多斯" : {
        "dcity": "dsn", "acityInfo": {
            "北京": "bjs", "长春": "cgq", "长沙": "csx", "成都": "ctu", "广州": "can", "杭州": "hgh", "邯郸": "hdg", "哈尔滨": "hrb",
            "济南": "tna", "济宁": "jng", "昆明": "kmg", "兰州": "lhw", "南京": "nkg", "南昌": "khn", "三亚": "syx", "沈阳": "she",
            "上海": "sha", "石家庄": "sjw", "深圳": "szx", "温州": "wnz", "厦门": "xmn", "西安": "sia", "珠海": "zuh", "郑州": "cgo"}},
    "额济纳旗" : {"dcity": "ejn", "acityInfo": {"西安": "sia", "阿拉善左旗": "axf"}},
    "恩施"   : {
        "dcity": "enh", "acityInfo": {
            "北京": "bjs", "成都": "ctu", "大连": "dlc", "福州": "foc", "贵阳": "kwe", "广州": "can", "杭州": "hgh", "昆明": "kmg",
            "兰州": "lhw", "南京": "nkg", "南宁": "nng", "青岛": "tao", "深圳": "szx", "上海": "sha", "太原": "tyn", "天津": "tsn",
            "武汉": "wuh", "厦门": "xmn", "西安": "sia", "郑州": "cgo"}},
    "二连浩特" : {"dcity": "erl", "acityInfo": {"呼和浩特": "het", "北京": "bjs", "赤峰": "cif", "通辽": "tgo"}},
    "阜阳"   : {
        "dcity": "fug", "acityInfo": {
            "北京" : "bjs", "长沙": "csx", "重庆": "ckg", "成都": "ctu", "大连": "dlc", "大理": "dlu", "贵阳": "kwe", "广州": "can",
            "哈尔滨": "hrb", "海口": "hak", "惠州": "huz", "昆明": "kmg", "拉萨": "lxa", "青岛": "tao", "深圳": "szx", "三亚": "syx",
            "天津" : "tsn", "温州": "wnz", "厦门": "xmn", "烟台": "ynt", "银川": "inc", "舟山": "hsn"}},
    "抚远"   : {"dcity": "fyj", "acityInfo": {"哈尔滨": "hrb", "北京": "bjs", "上海": "sha"}},
    "富蕴"   : {"dcity": "fyn", "acityInfo": {"阿勒泰": "aat", "布尔津": "kji", "乌鲁木齐": "urc"}},
    "果洛"   : {"dcity": "gmq", "acityInfo": {"西宁": "xnn", "成都": "ctu", "拉萨": "lxa"}},
    "格尔木"  : {"dcity": "goq", "acityInfo": {"西安": "sia", "西宁": "xnn", "郑州": "cgo", "成都": "ctu", "拉萨": "lxa"}},
    "广元"   : {
        "dcity": "gys", "acityInfo": {
            "北京": "bjs", "深圳": "szx", "广州": "can", "乌鲁木齐": "urc", "杭州": "hgh", "济南": "tna", "昆明": "kmg", "南宁": "nng"}},
    "固原"   : {
        "dcity"    : "gyu",
        "acityInfo": {"北京": "bjs", "上海": "sha", "重庆": "ckg", "天津": "tsn", "福州": "foc", "西安": "sia", "银川": "inc"}},
    "赣州"   : {
        "dcity": "kow", "acityInfo": {
            "北京": "bjs", "巴彦淖尔": "rlk", "重庆": "ckg", "成都": "ctu", "常州": "czx", "长沙": "csx", "广州": "can", "贵阳": "kwe",
            "海口": "hak", "哈尔滨": "hrb", "杭州": "hgh", "济南": "tna", "昆明": "kmg", "南京": "nkg", "南宁": "nng", "宁波": "ngb",
            "青岛": "tao", "三亚": "syx", "沈阳": "she", "上海": "sha", "太原": "tyn", "武汉": "wuh", "西安": "sia", "厦门": "xmn",
            "湛江": "zha", "郑州": "cgo", "珠海": "zuh"}},
    "贵阳"   : {
        "dcity": "kwe", "acityInfo": {
            "包头"  : "bav", "北海": "bhy", "北京": "bjs", "毕节": "bfj", "保山": "bsd", "长春": "cgq", "成都": "ctu", "常州": "czx",
            "重庆"  : "ckg", "长沙": "csx", "大理": "dlu", "达州": "dax", "大连": "dlc", "恩施": "enh", "阜阳": "fug", "福州": "foc",
            "广州"  : "can", "赣州": "kow", "杭州": "hgh", "呼和浩特": "het", "合肥": "hfe", "黄山": "txn", "衡阳": "hny", "淮安": "hia",
            "海口"  : "hak", "惠州": "huz", "邯郸": "hdg", "哈尔滨": "hrb", "济宁": "jng", "济南": "tna", "揭阳": "swa", "凯里": "kjh",
            "连云港" : "lyg", "临沂": "lyi", "六盘水": "lpf", "兰州": "lhw", "吕梁": "llv", "泸州": "lzo", "临汾": "lfq", "荔波": "llb",
            "黎平"  : "hzh", "拉萨": "lxa", "丽江": "ljg", "芒市": "lum", "南阳": "nny", "南宁": "nng", "南昌": "khn", "南京": "nkg",
            "南通"  : "ntg", "宁波": "ngb", "琼海": "bar", "泉州": "jjn", "衢州": "juz", "青岛": "tao", "十堰": "wds", "上海": "sha",
            "深圳"  : "szx", "石家庄": "sjw", "沈阳": "she", "三亚": "syx", "铜仁": "ten", "台州": "hyn", "太原": "tyn", "天津": "tsn",
            "腾冲"  : "tcz", "无锡": "wux", "武汉": "wuh", "温州": "wnz", "乌鲁木齐": "urc", "万州": "wxn", "文山": "wnh", "忻州": "wut",
            "西双版纳": "jhg", "西宁": "xnn", "西昌": "xic", "兴义": "acx", "襄阳": "xfn", "西安": "sia", "徐州": "xuz", "厦门": "xmn",
            "宜昌"  : "yih", "银川": "inc", "烟台": "ynt", "宜春": "yic", "运城": "ycu", "义乌": "yiw", "岳阳": "yya", "湛江": "zha",
            "郑州"  : "cgo", "珠海": "zuh"}},
    "桂林"   : {
        "dcity": "kwl", "acityInfo": {
            "北海"  : "bhy", "北京": "bjs", "重庆": "ckg", "长治": "cih", "长春": "cgq", "成都": "ctu", "福州": "foc", "淮安": "hia",
            "杭州"  : "hgh", "合肥": "hfe", "哈尔滨": "hrb", "海口": "hak", "揭阳": "swa", "济南": "tna", "昆明": "kmg", "临沂": "lyi",
            "丽江"  : "ljg", "泸州": "lzo", "兰州": "lhw", "南宁": "nng", "南通": "ntg", "南京": "nkg", "攀枝花": "pzi", "青岛": "tao",
            "泉州"  : "jjn", "琼海": "bar", "沈阳": "she", "上海": "sha", "三亚": "syx", "石家庄": "sjw", "十堰": "wds", "太原": "tyn",
            "天津"  : "tsn", "铜仁": "ten", "万州": "wxn", "潍坊": "wef", "温州": "wnz", "厦门": "xmn", "西安": "sia", "西宁": "xnn",
            "西双版纳": "jhg", "徐州": "xuz", "扬州": "yty", "烟台": "ynt", "银川": "inc", "郑州": "cgo", "遵义": "zyi"}},
    "红原"   : {"dcity": "ahj", "acityInfo": {"拉萨": "lxa", "成都": "ctu"}},
    "海口"   : {
        "dcity": "hak", "acityInfo": {
            "安庆" : "aqg", "毕节": "bfj", "巴彦淖尔": "rlk", "百色": "aeb", "北京": "bjs", "巴中": "bzx", "长春": "cgq", "成都": "ctu",
            "重庆" : "ckg", "常州": "czx", "常德": "cgd", "长沙": "csx", "达州": "dax", "大同": "dat", "大连": "dlc", "福州": "foc",
            "阜阳" : "fug", "桂林": "kwl", "贵阳": "kwe", "广州": "can", "赣州": "kow", "合肥": "hfe", "惠州": "huz", "淮安": "hia",
            "海拉尔": "hld", "呼和浩特": "het", "邯郸": "hdg", "怀化": "hjj", "黄山": "txn", "杭州": "hgh", "河池": "hcj", "衡阳": "hny",
            "哈尔滨": "hrb", "汉中": "hzg", "揭阳": "swa", "井冈山": "jgs", "济宁": "jng", "济南": "tna", "景德镇": "jdz", "昆明": "kmg",
            "临汾" : "lfq", "吕梁": "llv", "柳州": "lzh", "临沂": "lyi", "兰州": "lhw", "陇南": "lnl", "洛阳": "lya", "泸州": "lzo",
            "连云港": "lyg", "梅州": "mxz", "绵阳": "mig", "南宁": "nng", "南阳": "nny", "南通": "ntg", "南京": "nkg", "南昌": "khn",
            "宁波" : "ngb", "黔江": "jiq", "泉州": "jjn", "青岛": "tao", "衢州": "juz", "沈阳": "she", "上海": "sha", "十堰": "wds",
            "深圳" : "szx", "石家庄": "sjw", "邵阳": "wgn", "三明": "sqj", "天津": "tsn", "太原": "tyn", "唐山": "tvs", "潍坊": "wef",
            "温州" : "wnz", "武汉": "wuh", "万州": "wxn", "乌鲁木齐": "urc", "西宁": "xnn", "徐州": "xuz", "襄阳": "xfn", "信阳": "xai",
            "西安" : "sia", "忻州": "wut", "西昌": "xic", "厦门": "xmn", "玉林": "ylx", "宜春": "yic", "银川": "inc", "榆林": "uyn",
            "运城" : "ycu", "宜昌": "yih", "烟台": "ynt", "营口": "ykh", "扬州": "yty", "盐城": "ynz", "宜宾": "ybp", "湛江": "zha",
            "郑州" : "cgo", "遵义": "zyi", "珠海": "zuh"}},
    "河池"   : {"dcity": "hcj", "acityInfo": {"海口": "hak", "长沙": "csx"}},
    "邯郸"   : {
        "dcity": "hdg", "acityInfo": {
            "成都" : "ctu", "重庆": "ckg", "大连": "dlc", "鄂尔多斯": "dsn", "贵阳": "kwe", "广州": "can", "呼和浩特": "het", "杭州": "hgh",
            "哈尔滨": "hrb", "海口": "hak", "昆明": "kmg", "兰州": "lhw", "南京": "nkg", "青岛": "tao", "深圳": "szx", "上海": "sha",
            "三亚" : "syx", "温州": "wnz", "西宁": "xnn", "宜昌": "yih", "珠海": "zuh"}},
    "黑河"   : {"dcity": "hek", "acityInfo": {"哈尔滨": "hrb", "北京": "bjs", "珠海": "zuh", "郑州": "cgo", "上海": "sha"}},
    "呼和浩特" : {
        "dcity": "het", "acityInfo": {
            "阿克苏" : "aku", "阿尔山": "yie", "阿拉善左旗": "axf", "巴彦淖尔": "rlk", "北京": "bjs", "重庆": "ckg", "长沙": "csx",
            "成都"  : "ctu",
            "赤峰"  : "cif", "长春": "cgq", "大连": "dlc", "二连浩特": "erl", "福州": "foc", "广州": "can", "贵阳": "kwe", "邯郸": "hdg",
            "哈尔滨" : "hrb", "合肥": "hfe", "哈密": "hmi", "霍林郭勒": "huo", "海口": "hak", "海拉尔": "hld", "杭州": "hgh",
            "加格达奇": "jgd",
            "济南"  : "tna", "库尔勒": "krl", "昆明": "kmg", "丽江": "ljg", "洛阳": "lya", "兰州": "lhw", "吕梁": "llv", "连云港": "lyg",
            "满洲里" : "nzh", "南宁": "nng", "南京": "nkg", "南昌": "khn", "南阳": "nny", "青岛": "tao", "泉州": "jjn", "衢州": "juz",
            "十堰"  : "wds", "三亚": "syx", "上海": "sha", "沈阳": "she", "石家庄": "sjw", "深圳": "szx", "吐鲁番": "tlq", "太原": "tyn",
            "通辽"  : "tgo", "天津": "tsn", "武汉": "wuh", "温州": "wnz", "乌海": "wua", "乌兰浩特": "hlh", "威海": "weh",
            "乌鲁木齐": "urc",
            "忻州"  : "wut", "厦门": "xmn", "西安": "sia", "锡林浩特": "xil", "襄阳": "xfn", "西宁": "xnn", "兴义": "acx", "延安": "eny",
            "宜昌"  : "yih", "烟台": "ynt", "运城": "ycu", "湛江": "zha", "遵义": "zyi", "郑州": "cgo", "扎兰屯": "nzl", "珠海": "zuh"}},
    "合肥"   : {
        "dcity": "hfe", "acityInfo": {
            "阿克苏": "aku", "北海": "bhy", "北京": "bjs", "长春": "cgq", "成都": "ctu", "重庆": "ckg", "大同": "dat", "大理": "dlu",
            "大连" : "dlc", "广州": "can", "桂林": "kwl", "贵阳": "kwe", "和田": "htn", "哈尔滨": "hrb", "海口": "hak", "呼和浩特": "het",
            "揭阳" : "swa", "库尔勒": "krl", "昆明": "kmg", "拉萨": "lxa", "兰州": "lhw", "临汾": "lfq", "丽江": "ljg", "绵阳": "mig",
            "南昌" : "khn", "南宁": "nng", "青岛": "tao", "泉州": "jjn", "三亚": "syx", "十堰": "wds", "沈阳": "she", "深圳": "szx",
            "太原" : "tyn", "乌鲁木齐": "urc", "威海": "weh", "西宁": "xnn", "西安": "sia", "兴义": "acx", "厦门": "xmn", "烟台": "ynt",
            "银川" : "inc", "运城": "ycu", "玉林": "ylx", "榆林": "uyn", "遵义": "zyi", "湛江": "zha", "珠海": "zuh"}},
    "淮安"   : {
        "dcity": "hia", "acityInfo": {
            "北京": "bjs", "重庆": "ckg", "长春": "cgq", "成都": "ctu", "长沙": "csx", "大连": "dlc", "福州": "foc", "桂林": "kwl",
            "贵阳": "kwe", "广州": "can", "海口": "hak", "昆明": "kmg", "南昌": "khn", "南宁": "nng", "泉州": "jjn", "深圳": "szx",
            "沈阳": "she", "上海": "sha", "武汉": "wuh", "西安": "sia", "厦门": "xmn", "珠海": "zuh"}},
    "怀化"   : {
        "dcity": "hjj", "acityInfo": {
            "北京": "bjs", "三亚": "syx", "西安": "sia", "海口": "hak", "杭州": "hgh", "济南": "tna", "丽江": "ljg", "南宁": "nng"}},
    "海拉尔"  : {
        "dcity": "hld", "acityInfo": {
            "青岛": "tao", "北京": "bjs", "成都": "ctu", "赤峰": "cif", "重庆": "ckg", "上海": "sha", "天津": "tsn", "通辽": "tgo",
            "杭州": "hgh", "海口": "hak", "呼和浩特": "het", "哈尔滨": "hrb", "加格达奇": "jgd", "扎兰屯": "nzl", "昆明": "kmg",
            "南京": "nkg"}},
    "哈密"   : {
        "dcity": "hmi", "acityInfo": {
            "阿克苏": "aku", "北京": "bjs", "石河子": "shf", "成都": "ctu", "西宁": "xnn", "西安": "sia", "呼和浩特": "het", "郑州": "cgo",
            "库尔勒": "krl", "库车": "kca"}},
    "衡阳"   : {
        "dcity": "hny", "acityInfo": {
            "北京": "bjs", "北海": "bhy", "重庆": "ckg", "成都": "ctu", "大连": "dlc", "福州": "foc", "贵阳": "kwe", "杭州": "hgh",
            "惠州": "huz", "海口": "hak", "济南": "tna", "昆明": "kmg", "兰州": "lhw", "丽江": "ljg", "南京": "nkg", "宁波": "ngb",
            "泉州": "jjn", "三亚": "syx", "上海": "sha", "温州": "wnz", "乌鲁木齐": "urc", "厦门": "xmn", "西安": "sia", "烟台": "ynt",
            "珠海": "zuh"}},
    "哈尔滨"  : {
        "dcity": "hrb", "acityInfo": {
            "阿尔山" : "yie", "北京": "bjs", "北海": "bhy", "赤峰": "cif", "长沙": "csx", "重庆": "ckg", "成都": "ctu", "常州": "czx",
            "大同"  : "dat", "鄂尔多斯": "dsn", "抚远": "fyj", "福州": "foc", "阜阳": "fug", "广州": "can", "贵阳": "kwe", "赣州": "kow",
            "桂林"  : "kwl", "呼和浩特": "het", "合肥": "hfe", "杭州": "hgh", "海拉尔": "hld", "黑河": "hek", "邯郸": "hdg", "海口": "hak",
            "惠州"  : "huz", "加格达奇": "jgd", "建三江": "jsj", "揭阳": "swa", "济宁": "jng", "鸡西": "jxa", "济南": "tna",
            "嘉峪关" : "jgn", "锦州": "jnz", "昆明": "kmg", "兰州": "lhw", "临沂": "lyi", "连云港": "lyg", "洛阳": "lya", "丽江": "ljg",
            "满洲里" : "nzh", "漠河": "ohe", "南京": "nkg", "南昌": "khn", "宁波": "ngb", "南通": "ntg", "南宁": "nng", "泉州": "jjn",
            "秦皇岛" : "bpe", "青岛": "tao", "琼海": "bar", "日照": "riz", "上海": "sha", "深圳": "szx", "上饶": "sqd", "石家庄": "sjw",
            "三亚"  : "syx", "十堰": "wds", "太原": "tyn", "天津": "tsn", "通辽": "tgo", "唐山": "tvs", "乌兰浩特": "hlh",
            "乌鲁木齐": "urc", "五大连池": "dtu", "无锡": "wux", "温州": "wnz", "武汉": "wuh", "威海": "weh", "潍坊": "wef",
            "西双版纳": "jhg", "忻州": "wut", "襄阳": "xfn", "西宁": "xnn", "厦门": "xmn", "西安": "sia", "徐州": "xuz", "烟台": "ynt",
            "扬州"  : "yty", "榆林": "uyn", "延吉": "ynj", "运城": "ycu", "盐城": "ynz", "银川": "inc", "郑州": "cgo", "张家口": "zqz",
            "珠海"  : "zuh"}},
    "和田"   : {
        "dcity": "htn", "acityInfo": {
            "阿克苏": "aku", "阿勒泰": "aat", "北京": "bjs", "重庆": "ckg", "成都": "ctu", "合肥": "hfe", "库尔勒": "krl", "兰州": "lhw",
            "且末" : "iqm", "若羌": "rqa", "莎车": "qsz", "石河子": "shf", "图木舒克": "twc", "乌鲁木齐": "urc", "西安": "sia",
            "玉林" : "ylx"}},
    "花土沟"  : {"dcity": "htt", "acityInfo": {"敦煌": "dnh", "西宁": "xnn", "西安": "sia"}},
    "霍林郭勒" : {"dcity": "huo", "acityInfo": {"呼和浩特": "het", "沈阳": "she", "通辽": "tgo"}},
    "惠阳"   : {
        "dcity": "huz", "acityInfo": {
            "北京": "bjs", "成都": "ctu", "常德": "cgd", "长沙": "csx", "重庆": "ckg", "大连": "dlc", "阜阳": "fug", "贵阳": "kwe",
            "衡阳": "hny", "哈尔滨": "hrb", "海口": "hak", "杭州": "hgh", "济南": "tna", "昆明": "kmg", "泸州": "lzo", "丽江": "ljg",
            "南充": "nao", "南京": "nkg", "南昌": "khn", "沈阳": "she", "上海": "sha", "太原": "tyn", "温州": "wnz", "武汉": "wuh",
            "无锡": "wux", "徐州": "xuz", "信阳": "xai", "西安": "sia", "襄阳": "xfn", "岳阳": "yya", "银川": "inc", "烟台": "ynt",
            "湛江": "zha", "郑州": "cgo", "张家界": "dyg"}},
    "汉中"   : {
        "dcity": "hzg", "acityInfo": {
            "北京": "bjs", "上海": "sha", "深圳": "szx", "广州": "can", "乌鲁木齐": "urc", "杭州": "hgh", "海口": "hak", "西安": "sia",
            "银川": "inc", "南京": "nkg", "南通": "ntg"}},
    "黄山"   : {
        "dcity": "txn", "acityInfo": {
            "青岛": "tao", "北京": "bjs", "沈阳": "she", "深圳": "szx", "重庆": "ckg", "成都": "ctu", "大连": "dlc", "贵阳": "kwe",
            "广州": "can", "西安": "sia", "厦门": "xmn", "海口": "hak", "宜昌": "yih", "烟台": "ynt", "昆明": "kmg", "南宁": "nng",
            "南通": "ntg"}},
    "景德镇"  : {
        "dcity": "jdz", "acityInfo": {
            "青岛": "tao", "北京": "bjs", "上海": "sha", "深圳": "szx", "重庆": "ckg", "成都": "ctu", "大连": "dlc", "天津": "tsn",
            "广州": "can", "海口": "hak", "西安": "sia", "厦门": "xmn", "昆明": "kmg", "南京": "nkg", "宁波": "ngb"}},
    "加格达奇" : {
        "dcity"    : "jgd",
        "acityInfo": {"呼和浩特": "het", "哈尔滨": "hrb", "海拉尔": "hld", "上海": "sha", "大连": "dlc", "漠河": "ohe"}},
    "嘉峪关"  : {
        "dcity": "jgn", "acityInfo": {
            "北京": "bjs", "成都": "ctu", "上海": "sha", "广州": "can", "西安": "sia", "杭州": "hgh", "哈尔滨": "hrb", "银川": "inc",
            "兰州": "lhw", "南京": "nkg"}},
    "井冈山"  : {
        "dcity": "jgs", "acityInfo": {
            "北京": "bjs", "沈阳": "she", "上海": "sha", "深圳": "szx", "成都": "ctu", "广州": "can", "厦门": "xmn", "西安": "sia",
            "海口": "hak", "珠海": "zuh", "昆明": "kmg", "南宁": "nng", "南京": "nkg"}},
    "景洪"   : {
        "dcity": "jhg", "acityInfo": {
            "毕节": "bfj", "北京": "bjs", "保山": "bsd", "重庆": "ckg", "长沙": "csx", "成都": "ctu", "迪庆": "dig", "大理": "dlu",
            "桂林": "kwl", "广州": "can", "贵阳": "kwe", "哈尔滨": "hrb", "杭州": "hgh", "昆明": "kmg", "丽江": "ljg", "泸州": "lzo",
            "洛阳": "lya", "兰州": "lhw", "澜沧": "jmj", "拉萨": "lxa", "临沧": "lnj", "芒市": "lum", "绵阳": "mig", "南宁": "nng",
            "南京": "nkg", "南昌": "khn", "宁蒗": "nlh", "攀枝花": "pzi", "青岛": "tao", "衢州": "juz", "沈阳": "she", "上海": "sha",
            "深圳": "szx", "腾冲": "tcz", "太原": "tyn", "天津": "tsn", "武汉": "wuh", "温州": "wnz", "文山": "wnh", "西安": "sia",
            "徐州": "xuz", "兴义": "acx", "西昌": "xic", "宜宾": "ybp", "扬州": "yty", "昭通": "zat", "遵义": "zyi", "郑州": "cgo"}},
    "金昌"   : {
        "dcity": "jic", "acityInfo": {
            "青岛": "tao", "北京": "bjs", "成都": "ctu", "上海": "sha", "乌鲁木齐": "urc", "西安": "sia", "榆林": "uyn", "兰州": "lhw"}},
    "晋江"   : {
        "dcity": "jjn", "acityInfo": {
            "北京" : "bjs", "常德": "cgd", "成都": "ctu", "长春": "cgq", "重庆": "ckg", "长沙": "csx", "常州": "czx", "达州": "dax",
            "大连" : "dlc", "佛山": "fuo", "广州": "can", "桂林": "kwl", "贵阳": "kwe", "海口": "hak", "衡阳": "hny", "合肥": "hfe",
            "哈尔滨": "hrb", "淮安": "hia", "杭州": "hgh", "呼和浩特": "het", "济南": "tna", "昆明": "kmg", "连云港": "lyg", "泸州": "lzo",
            "兰州" : "lhw", "绵阳": "mig", "芒市": "lum", "南通": "ntg", "南宁": "nng", "南京": "nkg", "南阳": "nny", "青岛": "tao",
            "石家庄": "sjw", "上海": "sha", "深圳": "szx", "沈阳": "she", "天津": "tsn", "太原": "tyn", "无锡": "wux", "乌鲁木齐": "urc",
            "武汉" : "wuh", "徐州": "xuz", "兴义": "acx", "西安": "sia", "西宁": "xnn", "襄阳": "xfn", "盐城": "ynz", "银川": "inc",
            "扬州" : "yty", "岳阳": "yya", "宜昌": "yih", "烟台": "ynt", "运城": "ycu", "珠海": "zuh", "舟山": "hsn", "郑州": "cgo",
            "张家界": "dyg"}},
    "佳木斯"  : {
        "dcity": "jmu", "acityInfo": {
            "青岛": "tao", "北京": "bjs", "上海": "sha", "大连": "dlc", "广州": "can", "杭州": "hgh", "烟台": "ynt", "济南": "tna",
            "南京": "nkg"}},
    "济宁"   : {
        "dcity": "jng", "acityInfo": {
            "北京": "bjs", "重庆": "ckg", "长沙": "csx", "成都": "ctu", "大连": "dlc", "鄂尔多斯": "dsn", "广州": "can", "贵阳": "kwe",
            "海口": "hak", "哈尔滨": "hrb", "昆明": "kmg", "南宁": "nng", "青岛": "tao", "三亚": "syx", "沈阳": "she", "上海": "sha",
            "深圳": "szx", "厦门": "xmn", "烟台": "ynt"}},
    "锦州"   : {
        "dcity": "jnz", "acityInfo": {
            "杭州": "hgh", "哈尔滨": "hrb", "深圳": "szx", "上海": "sha", "昆明": "kmg", "无锡": "wux", "武汉": "wuh"}},
    "建三江"  : {"dcity": "jsj", "acityInfo": {"哈尔滨": "hrb", "青岛": "tao", "北京": "bjs", "大连": "dlc"}},
    "鸡西"   : {
        "dcity": "jxa", "acityInfo": {
            "青岛": "tao", "北京": "bjs", "上海": "sha", "沈阳": "she", "三亚": "syx", "天津": "tsn", "大连": "dlc", "哈尔滨": "hrb"}},
    "九寨沟"  : {"dcity": "jzh", "acityInfo": {"北京": "bjs", "成都": "ctu"}},
    "库车"   : {
        "dcity": "kca", "acityInfo": {
            "阿克苏": "aku", "成都": "ctu", "吐鲁番": "tlq", "乌鲁木齐": "urc", "西安": "sia", "哈密": "hmi", "伊宁": "yin", "库尔勒": "krl",
            "宁波" : "ngb"}},
    "康定"   : {"dcity": "kgt", "acityInfo": {"成都": "ctu"}},
    "喀什"   : {
        "dcity": "khg", "acityInfo": {
            "阿克苏": "aku", "博乐": "bpl", "莎车": "qsz", "成都": "ctu", "重庆": "ckg", "图木舒克": "twc", "乌鲁木齐": "urc", "西安": "sia",
            "郑州" : "cgo", "济南": "tna", "库尔勒": "krl", "兰州": "lhw"}},
    "凯里"   : {"dcity": "kjh", "acityInfo": {"杭州": "hgh", "济南": "tna", "成都": "ctu", "贵阳": "kwe"}},
    "库尔勒"  : {
        "dcity": "krl", "acityInfo": {
            "阿勒泰": "aat", "阿克苏": "aku", "博乐": "bpl", "北京": "bjs", "成都": "ctu", "重庆": "ckg", "福州": "foc", "广州": "can",
            "和田" : "htn", "合肥": "hfe", "哈密": "hmi", "呼和浩特": "het", "杭州": "hgh", "济宁": "jng", "济南": "tna", "喀什": "khg",
            "昆明" : "kmg", "克拉玛依": "kry", "库车": "kca", "陇南": "lnl", "兰州": "lhw", "宁波": "ngb", "且末": "iqm", "青岛": "tao",
            "黔江" : "jiq", "若羌": "rqa", "莎车": "qsz", "三亚": "syx", "石家庄": "sjw", "上海": "sha", "石河子": "shf", "图木舒克": "twc",
            "吐鲁番": "tlq", "塔城": "tcg", "乌鲁木齐": "urc", "武汉": "wuh", "西安": "sia", "西宁": "xnn", "西双版纳": "jhg", "义乌": "yiw",
            "银川" : "inc", "伊宁": "yin", "郑州": "cgo"}},
    "克拉玛依" : {
        "dcity": "kry", "acityInfo": {
            "阿勒泰": "aat", "北京": "bjs", "博乐": "bpl", "成都": "ctu", "乌鲁木齐": "urc", "广州": "can", "西安": "sia", "伊宁": "yin",
            "郑州" : "cgo", "库尔勒": "krl"}},
    "黎平"   : {"dcity": "hzh", "acityInfo": {"长沙": "csx", "贵阳": "kwe"}},
    "澜沧"   : {
        "dcity": "jmj", "acityInfo": {
            "泉州": "jjn", "保山": "bsd", "重庆": "ckg", "成都": "ctu", "西双版纳": "jhg", "淮安": "hia", "郑州": "cgo", "湛江": "zha",
            "昆明": "kmg", "丽江": "ljg", "芒市": "lum"}},
    "连城"   : {
        "dcity"    : "lcx",
        "acityInfo": {"北京": "bjs", "上海": "sha", "天津": "tsn", "珠海": "zuh", "昆明": "kmg", "南京": "nkg"}},
    "临汾"   : {
        "dcity": "lfq", "acityInfo": {
            "北京": "bjs", "长春": "cgq", "长沙": "csx", "深圳": "szx", "上海": "sha", "大连": "dlc", "天津": "tsn", "贵阳": "kwe",
            "广州": "can", "武汉": "wuh", "杭州": "hgh", "合肥": "hfe", "海口": "hak", "昆明": "kmg", "南京": "nkg", "南宁": "nng"}},
    "兰州"   : {
        "dcity": "lhw", "acityInfo": {
            "阿克苏": "aku", "北京": "bjs", "重庆": "ckg", "长沙": "csx", "长春": "cgq", "成都": "ctu", "常德": "cgd", "大同": "dat",
            "敦煌" : "dnh", "恩施": "enh", "鄂尔多斯": "dsn", "福州": "foc", "贵阳": "kwe", "桂林": "kwl", "广州": "can", "邯郸": "hdg",
            "和田" : "htn", "杭州": "hgh", "哈尔滨": "hrb", "呼和浩特": "het", "衡阳": "hny", "海口": "hak", "合肥": "hfe", "金昌": "jic",
            "济南" : "tna", "嘉峪关": "jgn", "库尔勒": "krl", "昆明": "kmg", "喀什": "khg", "丽江": "ljg", "洛阳": "lya", "泸州": "lzo",
            "陇南" : "lnl", "连云港": "lyg", "吕梁": "llv", "拉萨": "lxa", "临沂": "lyi", "梅州": "mxz", "宁波": "ngb", "南通": "ntg",
            "南京" : "nkg", "南昌": "khn", "南宁": "nng", "南阳": "nny", "青岛": "tao", "琼海": "bar", "庆阳": "iqn", "泉州": "jjn",
            "沈阳" : "she", "深圳": "szx", "上海": "sha", "三亚": "syx", "石家庄": "sjw", "天津": "tsn", "吐鲁番": "tlq", "太原": "tyn",
            "武汉" : "wuh", "无锡": "wux", "乌鲁木齐": "urc", "万州": "wxn", "温州": "wnz", "厦门": "xmn", "信阳": "xai", "西双版纳": "jhg",
            "襄阳" : "xfn", "西昌": "xic", "西安": "sia", "延安": "eny", "榆林": "uyn", "银川": "inc", "宜昌": "yih", "珠海": "zuh",
            "郑州" : "cgo", "遵义": "zyi", "张掖": "yzy"}},
    "丽江"   : {
        "dcity": "ljg", "acityInfo": {
            "毕节": "bfj", "北京": "bjs", "沧源": "cwj", "成都": "ctu", "重庆": "ckg", "长沙": "csx", "福州": "foc", "贵阳": "kwe",
            "桂林": "kwl", "广州": "can", "衡阳": "hny", "怀化": "hjj", "杭州": "hgh", "哈尔滨": "hrb", "合肥": "hfe", "呼和浩特": "het",
            "惠州": "huz", "济南": "tna", "库尔勒": "krl", "昆明": "kmg", "澜沧": "jmj", "柳州": "lzh", "泸州": "lzo", "兰州": "lhw",
            "临沂": "lyi", "拉萨": "lxa", "梅州": "mxz", "绵阳": "mig", "宁波": "ngb", "南昌": "khn", "南京": "nkg", "南宁": "nng",
            "沈阳": "she", "邵阳": "wgn", "石家庄": "sjw", "十堰": "wds", "上海": "sha", "深圳": "szx", "武汉": "wuh", "无锡": "wux",
            "温州": "wnz", "襄阳": "xfn", "西宁": "xnn", "西安": "sia", "徐州": "xuz", "厦门": "xmn", "西双版纳": "jhg", "宜宾": "ybp",
            "运城": "ycu", "岳阳": "yya", "遵义": "zyi", "郑州": "cgo"}},
    "荔波"   : {"dcity": "llb", "acityInfo": {"重庆": "ckg", "长沙": "csx", "六盘水": "lpf", "广州": "can", "贵阳": "kwe"}},
    "吕梁"   : {
        "dcity": "llv", "acityInfo": {
            "青岛": "tao", "北京": "bjs", "沈阳": "she", "上海": "sha", "深圳": "szx", "重庆": "ckg", "长沙": "csx", "成都": "ctu",
            "大连": "dlc", "天津": "tsn", "贵阳": "kwe", "海口": "hak", "呼和浩特": "het", "杭州": "hgh", "郑州": "cgo", "兰州": "lhw",
            "南京": "nkg"}},
    "临沧"   : {
        "dcity"    : "lnj",
        "acityInfo": {"西双版纳": "jhg", "郑州": "cgo", "成都": "ctu", "长沙": "csx", "深圳": "szx", "昆明": "kmg"}},
    "陇南"   : {
        "dcity": "lnl", "acityInfo": {
            "北京": "bjs", "重庆": "ckg", "大理": "dlu", "广州": "can", "杭州": "hgh", "海口": "hak", "济南": "tna", "库尔勒": "krl",
            "兰州": "lhw", "南京": "nkg", "青岛": "tao", "上海": "sha", "深圳": "szx", "三亚": "syx", "吐鲁番": "tlq", "厦门": "xmn",
            "西安": "sia", "玉林": "ylx", "义乌": "yiw"}},
    "六盘水"  : {
        "dcity"    : "lpf",
        "acityInfo": {"北京": "bjs", "成都": "ctu", "福州": "foc", "广州": "can", "贵阳": "kwe", "厦门": "xmn", "荔波": "llb"}},
    "拉萨"   : {
        "dcity": "lxa", "acityInfo": {
            "阿里": "ngq", "北京": "bjs", "重庆": "ckg", "常德": "cgd", "成都": "ctu", "长治": "cih", "昌都": "bpx", "达州": "dax",
            "迪庆": "dig", "福州": "foc", "甘孜": "gzg", "贵阳": "kwe", "广州": "can", "果洛": "gmq", "格尔木": "goq", "淮安": "hia",
            "红原": "ahj", "合肥": "hfe", "呼和浩特": "het", "杭州": "hgh", "揭阳": "swa", "济南": "tna", "昆明": "kmg", "兰州": "lhw",
            "泸州": "lzo", "丽江": "ljg", "梅州": "mxz", "绵阳": "mig", "南充": "nao", "南昌": "khn", "南京": "nkg", "南宁": "nng",
            "邵阳": "wgn", "石家庄": "sjw", "上海": "sha", "太原": "tyn", "武汉": "wuh", "乌鲁木齐": "urc", "西宁": "xnn", "西安": "sia",
            "夏河": "gxh", "西双版纳": "jhg", "玉树": "yus", "玉林": "ylx", "宜宾": "ybp", "扬州": "yty", "郑州": "cgo"}},
    "洛阳"   : {
        "dcity": "lya", "acityInfo": {
            "北京": "bjs", "成都": "ctu", "大连": "dlc", "福州": "foc", "广州": "can", "海口": "hak", "呼和浩特": "het", "哈尔滨": "hrb",
            "昆明": "kmg", "兰州": "lhw", "南昌": "khn", "南宁": "nng", "青岛": "tao", "三亚": "syx", "深圳": "szx", "上海": "sha",
            "天津": "tsn", "西双版纳": "jhg", "珠海": "zuh"}},
    "连云港"  : {
        "dcity": "lyg", "acityInfo": {
            "北京": "bjs", "重庆": "ckg", "长沙": "csx", "成都": "ctu", "长春": "cgq", "大连": "dlc", "福州": "foc", "贵阳": "kwe",
            "广州": "can", "海口": "hak", "哈尔滨": "hrb", "呼和浩特": "het", "昆明": "kmg", "兰州": "lhw", "梅州": "mxz", "南京": "nkg",
            "南宁": "nng", "泉州": "jjn", "沈阳": "she", "石家庄": "sjw", "上海": "sha", "深圳": "szx", "太原": "tyn", "天津": "tsn",
            "武汉": "wuh", "乌鲁木齐": "urc", "温州": "wnz", "厦门": "xmn", "西宁": "xnn", "西安": "sia", "银川": "inc", "珠海": "zuh",
            "舟山": "hsn"}},
    "临沂"   : {
        "dcity": "lyi", "acityInfo": {
            "北京": "bjs", "长春": "cgq", "成都": "ctu", "重庆": "ckg", "长沙": "csx", "大连": "dlc", "福州": "foc", "桂林": "kwl",
            "广州": "can", "贵阳": "kwe", "哈尔滨": "hrb", "海口": "hak", "杭州": "hgh", "揭阳": "swa", "昆明": "kmg", "兰州": "lhw",
            "丽江": "ljg", "南昌": "khn", "宁波": "ngb", "南宁": "nng", "琼海": "bar", "三亚": "syx", "沈阳": "she", "深圳": "szx",
            "上海": "sha", "太原": "tyn", "天津": "tsn", "乌鲁木齐": "urc", "温州": "wnz", "武汉": "wuh", "无锡": "wux", "西安": "sia",
            "西宁": "xnn", "厦门": "xmn", "银川": "inc", "烟台": "ynt", "郑州": "cgo"}},
    "柳州"   : {
        "dcity": "lzh", "acityInfo": {
            "北京": "bjs", "重庆": "ckg", "成都": "ctu", "福州": "foc", "海口": "hak", "杭州": "hgh", "济南": "tna", "揭阳": "swa",
            "昆明": "kmg", "丽江": "ljg", "南京": "nkg", "南昌": "khn", "三亚": "syx", "深圳": "szx", "上海": "sha", "天津": "tsn",
            "武汉": "wuh", "西双版纳": "jhg", "厦门": "xmn", "郑州": "cgo"}},
    "泸州"   : {
        "dcity": "lzo", "acityInfo": {
            "北京"  : "bjs", "长沙": "csx", "大理": "dlu", "福州": "foc", "贵阳": "kwe", "桂林": "kwl", "广州": "can", "海口": "hak",
            "杭州"  : "hgh", "惠州": "huz", "揭阳": "swa", "济南": "tna", "昆明": "kmg", "兰州": "lhw", "丽江": "ljg", "拉萨": "lxa",
            "宁波"  : "ngb", "南昌": "khn", "南京": "nkg", "南宁": "nng", "泉州": "jjn", "青岛": "tao", "深圳": "szx", "石家庄": "sjw",
            "上海"  : "sha", "三亚": "syx", "太原": "tyn", "天津": "tsn", "武汉": "wuh", "乌鲁木齐": "urc", "温州": "wnz", "西昌": "xic",
            "西双版纳": "jhg", "厦门": "xmn", "西宁": "xnn", "西安": "sia", "银川": "inc", "珠海": "zuh", "郑州": "cgo"}},
    "林芝"   : {
        "dcity": "lzy", "acityInfo": {
            "深圳": "szx", "成都": "ctu", "重庆": "ckg", "广州": "can", "西昌": "xic", "西安": "sia", "珠海": "zuh", "南阳": "nny"}},
    "牡丹江"  : {
        "dcity": "mdg", "acityInfo": {
            "青岛": "tao", "北京": "bjs", "深圳": "szx", "沈阳": "she", "上海": "sha", "大连": "dlc", "威海": "weh", "广州": "can",
            "杭州": "hgh", "烟台": "ynt", "济南": "tna"}},
    "绵阳"   : {
        "dcity": "mig", "acityInfo": {
            "北海": "bhy", "北京": "bjs", "长沙": "csx", "大理": "dlu", "福州": "foc", "广州": "can", "海口": "hak", "杭州": "hgh",
            "合肥": "hfe", "揭阳": "swa", "济南": "tna", "昆明": "kmg", "丽江": "ljg", "拉萨": "lxa", "宁波": "ngb", "南京": "nkg",
            "南昌": "khn", "南宁": "nng", "琼海": "bar", "泉州": "jjn", "深圳": "szx", "石家庄": "sjw", "上海": "sha", "三亚": "syx",
            "腾冲": "tcz", "天津": "tsn", "武汉": "wuh", "乌鲁木齐": "urc", "温州": "wnz", "厦门": "xmn", "西昌": "xic", "徐州": "xuz",
            "西宁": "xnn", "西双版纳": "jhg", "郑州": "cgo"}},
    "梅县"   : {
        "dcity": "mxz", "acityInfo": {
            "北京": "bjs", "上海": "sha", "深圳": "szx", "重庆": "ckg", "长沙": "csx", "广州": "can", "西安": "sia", "海口": "hak",
            "宜昌": "yih", "湛江": "zha", "珠海": "zuh"}},
    "满洲里"  : {"dcity": "nzh", "acityInfo": {"哈尔滨": "hrb", "呼和浩特": "het", "北京": "bjs", "太原": "tyn", "天津": "tsn"}},
    "漠河"   : {"dcity": "ohe", "acityInfo": {"哈尔滨": "hrb", "北京": "bjs", "加格达奇": "jgd"}},
    "南昌"   : {
        "dcity": "khn", "acityInfo": {
            "阿克苏": "aku", "北京": "bjs", "长春": "cgq", "长治": "cih", "成都": "ctu", "重庆": "ckg", "大连": "dlc", "鄂尔多斯": "dsn",
            "贵阳" : "kwe", "广州": "can", "哈尔滨": "hrb", "合肥": "hfe", "呼和浩特": "het", "淮安": "hia", "海口": "hak", "惠州": "huz",
            "揭阳" : "swa", "济南": "tna", "昆明": "kmg", "库尔勒": "krl", "临沂": "lyi", "兰州": "lhw", "泸州": "lzo", "洛阳": "lya",
            "柳州" : "lzh", "丽江": "ljg", "拉萨": "lxa", "梅州": "mxz", "绵阳": "mig", "芒市": "lum", "宁波": "ngb", "南京": "nkg",
            "南通" : "ntg", "南宁": "nng", "青岛": "tao", "深圳": "szx", "石家庄": "sjw", "沈阳": "she", "上海": "sha", "三亚": "syx",
            "天津" : "tsn", "太原": "tyn", "乌鲁木齐": "urc", "威海": "weh", "西双版纳": "jhg", "厦门": "xmn", "徐州": "xuz", "西安": "sia",
            "银川" : "inc", "运城": "ycu", "烟台": "ynt", "扬州": "yty", "盐城": "ynz", "遵义": "zyi", "郑州": "cgo", "珠海": "zuh",
            "湛江" : "zha", "舟山": "hsn"}},
    "南充"   : {
        "dcity": "nao", "acityInfo": {
            "北京": "bjs", "上海": "sha", "深圳": "szx", "长沙": "csx", "福州": "foc", "武汉": "wuh", "乌鲁木齐": "urc", "温州": "wnz",
            "广州": "can", "杭州": "hgh", "惠州": "huz", "厦门": "xmn", "昆明": "kmg", "拉萨": "lxa"}},
    "宁波"   : {
        "dcity": "ngb", "acityInfo": {
            "阿克苏": "aku", "安庆": "aqg", "毕节": "bfj", "北京": "bjs", "长沙": "csx", "成都": "ctu", "重庆": "ckg", "长春": "cgq",
            "大连" : "dlc", "赣州": "kow", "广州": "can", "贵阳": "kwe", "海口": "hak", "哈尔滨": "hrb", "衡阳": "hny", "景德镇": "jdz",
            "揭阳" : "swa", "库尔勒": "krl", "昆明": "kmg", "库车": "kca", "丽江": "ljg", "泸州": "lzo", "兰州": "lhw", "临沂": "lyi",
            "绵阳" : "mig", "南宁": "nng", "南阳": "nny", "南昌": "khn", "琼海": "bar", "青岛": "tao", "三亚": "syx", "石家庄": "sjw",
            "沈阳" : "she", "深圳": "szx", "太原": "tyn", "天津": "tsn", "威海": "weh", "武汉": "wuh", "万州": "wxn", "信阳": "xai",
            "厦门" : "xmn", "西安": "sia", "西宁": "xnn", "西昌": "xic", "襄阳": "xfn", "兴义": "acx", "延吉": "ynj", "宜宾": "ybp",
            "宜昌" : "yih", "银川": "inc", "宜春": "yic", "运城": "ycu", "烟台": "ynt", "珠海": "zuh", "郑州": "cgo"}},
    "宁蒗"   : {
        "dcity"    : "nlh",
        "acityInfo": {"普洱": "sym", "西双版纳": "jhg", "重庆": "ckg", "成都": "ctu", "昆明": "kmg", "广州": "can"}},
    "南宁"   : {
        "dcity": "nng", "acityInfo": {
            "北京" : "bjs", "保山": "bsd", "常州": "czx", "长沙": "csx", "长春": "cgq", "成都": "ctu", "重庆": "ckg", "常德": "cgd",
            "达州" : "dax", "大连": "dlc", "恩施": "enh", "福州": "foc", "贵阳": "kwe", "广元": "gys", "赣州": "kow", "桂林": "kwl",
            "广州" : "can", "海口": "hak", "呼和浩特": "het", "淮安": "hia", "怀化": "hjj", "黄山": "txn", "杭州": "hgh", "合肥": "hfe",
            "哈尔滨": "hrb", "井冈山": "jgs", "济宁": "jng", "济南": "tna", "揭阳": "swa", "昆明": "kmg", "洛阳": "lya", "泸州": "lzo",
            "临汾" : "lfq", "连云港": "lyg", "临沂": "lyi", "拉萨": "lxa", "兰州": "lhw", "丽江": "ljg", "绵阳": "mig", "宁波": "ngb",
            "南通" : "ntg", "南阳": "nny", "南昌": "khn", "南京": "nkg", "普洱": "sym", "青岛": "tao", "衢州": "juz", "泉州": "jjn",
            "沈阳" : "she", "邵阳": "wgn", "石家庄": "sjw", "深圳": "szx", "上海": "sha", "十堰": "wds", "三亚": "syx", "太原": "tyn",
            "天津" : "tsn", "乌鲁木齐": "urc", "万州": "wxn", "巫山": "wsk", "温州": "wnz", "武汉": "wuh", "无锡": "wux", "潍坊": "wef",
            "襄阳" : "xfn", "西双版纳": "jhg", "西昌": "xic", "厦门": "xmn", "忻州": "wut", "徐州": "xuz", "西安": "sia", "盐城": "ynz",
            "运城" : "ycu", "宜宾": "ybp", "榆林": "uyn", "烟台": "ynt", "宜昌": "yih", "银川": "inc", "张家口": "zqz", "郑州": "cgo"}},
    "南阳"   : {
        "dcity": "nny", "acityInfo": {
            "北京": "bjs", "重庆": "ckg", "福州": "foc", "广州": "can", "贵阳": "kwe", "海口": "hak", "呼和浩特": "het", "揭阳": "swa",
            "济南": "tna", "兰州": "lhw", "南宁": "nng", "宁波": "ngb", "青岛": "tao", "泉州": "jjn", "上海": "sha", "深圳": "szx",
            "太原": "tyn", "天津": "tsn", "乌鲁木齐": "urc", "厦门": "xmn", "西安": "sia", "珠海": "zuh"}},
    "南通"   : {
        "dcity": "ntg", "acityInfo": {
            "北京": "bjs", "成都": "ctu", "长沙": "csx", "长春": "cgq", "重庆": "ckg", "大连": "dlc", "福州": "foc", "桂林": "kwl",
            "贵阳": "kwe", "广州": "can", "黄山": "txn", "哈尔滨": "hrb", "汉中": "hzg", "海口": "hak", "济南": "tna", "昆明": "kmg",
            "兰州": "lhw", "南宁": "nng", "南昌": "khn", "青岛": "tao", "泉州": "jjn", "深圳": "szx", "沈阳": "she", "石家庄": "sjw",
            "三亚": "syx", "太原": "tyn", "天津": "tsn", "武汉": "wuh", "温州": "wnz", "厦门": "xmn", "西宁": "xnn", "西安": "sia",
            "烟台": "ynt", "银川": "inc", "岳阳": "yya", "珠海": "zuh", "郑州": "cgo"}},
    "攀枝花"  : {
        "dcity": "pzi", "acityInfo": {
            "北京": "bjs", "重庆": "ckg", "成都": "ctu", "上海": "sha", "沈阳": "she", "武汉": "wuh", "桂林": "kwl", "西双版纳": "jhg"}},
    "普洱"   : {
        "dcity": "sym", "acityInfo": {
            "北京": "bjs", "保山": "bsd", "成都": "ctu", "长沙": "csx", "上海": "sha", "文山": "wnh", "广州": "can", "湛江": "zha",
            "昆明": "kmg", "芒市": "lum", "南宁": "nng", "宁蒗": "nlh"}},
    "琼海"   : {
        "dcity": "bar", "acityInfo": {
            "北京" : "bjs", "北海": "bhy", "成都": "ctu", "重庆": "ckg", "大连": "dlc", "福州": "foc", "贵阳": "kwe", "桂林": "kwl",
            "哈尔滨": "hrb", "济南": "tna", "兰州": "lhw", "临沂": "lyi", "绵阳": "mig", "宁波": "ngb", "青岛": "tao", "深圳": "szx",
            "沈阳" : "she", "石家庄": "sjw", "上海": "sha", "太原": "tyn", "武汉": "wuh", "乌鲁木齐": "urc", "徐州": "xuz", "银川": "inc",
            "郑州" : "cgo", "遵义": "zyi"}},
    "秦皇岛"  : {
        "dcity": "bpe", "acityInfo": {
            "哈尔滨": "hrb", "杭州": "hgh", "厦门": "xmn", "上海": "sha", "石家庄": "sjw", "大同": "dat", "广州": "can"}},
    "祁连"   : {"dcity": "hbq", "acityInfo": {"西宁": "xnn"}},
    "且末"   : {"dcity": "iqm", "acityInfo": {"和田": "htn", "若羌": "rqa", "重庆": "ckg", "库尔勒": "krl", "乌鲁木齐": "urc"}},
    "庆阳"   : {"dcity": "iqn", "acityInfo": {"北京": "bjs", "深圳": "szx", "天津": "tsn", "兰州": "lhw"}},
    "黔江"   : {
        "dcity": "jiq", "acityInfo": {
            "北京"  : "bjs", "北海": "bhy", "重庆": "ckg", "成都": "ctu", "长沙": "csx", "广州": "can", "海口": "hak", "杭州": "hgh",
            "济南"  : "tna", "拉萨": "lxa", "梅州": "mxz", "青岛": "tao", "深圳": "szx", "邵阳": "wgn", "上海": "sha", "温州": "wnz",
            "乌鲁木齐": "urc", "武汉": "wuh", "厦门": "xmn", "银川": "inc", "郑州": "cgo"}},
    "衢州"   : {
        "dcity": "juz", "acityInfo": {
            "北京": "bjs", "百色": "aeb", "保山": "bsd", "成都": "ctu", "重庆": "ckg", "大连": "dlc", "大理": "dlu", "贵阳": "kwe",
            "海口": "hak", "济南": "tna", "昆明": "kmg", "拉萨": "lxa", "青岛": "tao", "深圳": "szx", "三亚": "syx", "武汉": "wuh",
            "兴义": "acx", "西安": "sia", "银川": "inc", "珠海": "zuh", "昭通": "zat", "舟山": "hsn"}},
    "齐齐哈尔" : {
        "dcity": "ndg", "acityInfo": {
            "青岛": "tao", "北京": "bjs", "上海": "sha", "深圳": "szx", "沈阳": "she", "成都": "ctu", "天津": "tsn", "大连": "dlc",
            "广州": "can", "济南": "tna", "昆明": "kmg"}},
    "日照"   : {
        "dcity": "riz", "acityInfo": {
            "北京": "bjs", "长春": "cgq", "成都": "ctu", "重庆": "ckg", "长沙": "csx", "上海": "sha", "沈阳": "she", "三亚": "syx",
            "深圳": "szx", "太原": "tyn", "天津": "tsn", "大理": "dlu", "大连": "dlc", "福州": "foc", "广州": "can", "武汉": "wuh",
            "杭州": "hgh", "哈尔滨": "hrb", "昆明": "kmg", "拉萨": "lxa"}},
    "日喀则"  : {"dcity": "rkz", "acityInfo": {"西安": "sia", "济南": "tna", "成都": "ctu", "重庆": "ckg", "上海": "sha"}},
    "若羌"   : {"dcity": "rqa", "acityInfo": {"和田": "htn", "且末": "iqm", "郑州": "cgo", "库尔勒": "krl", "乌鲁木齐": "urc"}},
    "神农架"  : {"dcity": "hpg", "acityInfo": {"重庆": "ckg", "武汉": "wuh"}},
    "莎车"   : {
        "dcity"    : "qsz",
        "acityInfo": {"和田": "htn", "西安": "sia", "阿克苏": "aku", "库尔勒": "krl", "喀什": "khg", "乌鲁木齐": "urc"}},
    "沈阳"   : {
        "dcity": "she", "acityInfo": {
            "包头" : "bav", "北京": "bjs", "常州": "czx", "重庆": "ckg", "长沙": "csx", "成都": "ctu", "长治": "cih", "大庆": "dqa",
            "大同" : "dat", "鄂尔多斯": "dsn", "福州": "foc", "贵阳": "kwe", "赣州": "kow", "广州": "can", "桂林": "kwl", "淮安": "hia",
            "海口" : "hak", "合肥": "hfe", "杭州": "hgh", "惠州": "huz", "呼和浩特": "het", "黄山": "txn", "霍林郭勒": "huo", "济南": "tna",
            "济宁" : "jng", "鸡西": "jxa", "揭阳": "swa", "井冈山": "jgs", "昆明": "kmg", "临沂": "lyi", "兰州": "lhw", "丽江": "ljg",
            "连云港": "lyg", "吕梁": "llv", "牡丹江": "mdg", "宁波": "ngb", "南宁": "nng", "南通": "ntg", "南昌": "khn", "南京": "nkg",
            "攀枝花": "pzi", "琼海": "bar", "青岛": "tao", "泉州": "jjn", "齐齐哈尔": "ndg", "日照": "riz", "深圳": "szx", "石家庄": "sjw",
            "三亚" : "syx", "上海": "sha", "台州": "hyn", "唐山": "tvs", "太原": "tyn", "威海": "weh", "乌鲁木齐": "urc", "乌兰浩特": "hlh",
            "潍坊" : "wef", "无锡": "wux", "温州": "wnz", "武汉": "wuh", "西安": "sia", "徐州": "xuz", "西双版纳": "jhg", "厦门": "xmn",
            "襄阳" : "xfn", "忻州": "wut", "运城": "ycu", "伊春": "lds", "银川": "inc", "盐城": "ynz", "义乌": "yiw", "扬州": "yty",
            "烟台" : "ynt", "湛江": "zha", "珠海": "zuh", "郑州": "cgo"}},
    "石河子"  : {
        "dcity": "shf", "acityInfo": {
            "阿克苏": "aku", "北京": "bjs", "成都": "ctu", "上海": "sha", "图木舒克": "twc", "和田": "htn", "哈密": "hmi", "郑州": "cgo",
            "库尔勒": "krl"}},
    "石家庄"  : {
        "dcity": "sjw", "acityInfo": {
            "北京" : "bjs", "北海": "bhy", "重庆": "ckg", "承德": "cde", "长沙": "csx", "成都": "ctu", "长春": "cgq", "鄂尔多斯": "dsn",
            "福州" : "foc", "佛山": "fuo", "广州": "can", "贵阳": "kwe", "桂林": "kwl", "海口": "hak", "杭州": "hgh", "呼和浩特": "het",
            "哈尔滨": "hrb", "库尔勒": "krl", "昆明": "kmg", "丽江": "ljg", "泸州": "lzo", "拉萨": "lxa", "兰州": "lhw", "连云港": "lyg",
            "绵阳" : "mig", "梅州": "mxz", "南通": "ntg", "宁波": "ngb", "南宁": "nng", "南京": "nkg", "南昌": "khn", "泉州": "jjn",
            "秦皇岛": "bpe", "琼海": "bar", "三亚": "syx", "上海": "sha", "十堰": "wds", "深圳": "szx", "沈阳": "she", "唐山": "tvs",
            "温州" : "wnz", "乌兰浩特": "hlh", "乌鲁木齐": "urc", "乌海": "wua", "威海": "weh", "西安": "sia", "厦门": "xmn", "营口": "ykh",
            "岳阳" : "yya", "宜昌": "yih", "烟台": "ynt", "银川": "inc", "珠海": "zuh", "张家口": "zqz", "遵义": "zyi", "中卫": "zhy"}},
    "上饶"   : {
        "dcity": "sqd", "acityInfo": {
            "青岛": "tao", "北京": "bjs", "三亚": "syx", "深圳": "szx", "重庆": "ckg", "成都": "ctu", "佛山": "fuo", "哈尔滨": "hrb",
            "厦门": "xmn", "舟山": "hsn", "济南": "tna", "昆明": "kmg"}},
    "三明"   : {
        "dcity": "sqj", "acityInfo": {
            "北京": "bjs", "深圳": "szx", "邵阳": "wgn", "上海": "sha", "三亚": "syx", "重庆": "ckg", "广州": "can", "西双版纳": "jhg",
            "海口": "hak", "郑州": "cgo", "芒市": "lum", "南京": "nkg"}},
    "十堰"   : {
        "dcity": "wds", "acityInfo": {
            "北京": "bjs", "长沙": "csx", "重庆": "ckg", "成都": "ctu", "大连": "dlc", "大理": "dlu", "佛山": "fuo", "广州": "can",
            "桂林": "kwl", "贵阳": "kwe", "杭州": "hgh", "呼和浩特": "het", "哈尔滨": "hrb", "海口": "hak", "合肥": "hfe", "济南": "tna",
            "昆明": "kmg", "丽江": "ljg", "南宁": "nng", "南京": "nkg", "青岛": "tao", "石家庄": "sjw", "三亚": "syx", "深圳": "szx",
            "太原": "tyn", "天津": "tsn", "温州": "wnz", "乌鲁木齐": "urc", "厦门": "xmn", "西安": "sia", "银川": "inc", "珠海": "zuh"}},
    "邵阳"   : {
        "dcity": "wgn", "acityInfo": {
            "北京": "bjs", "长沙": "csx", "重庆": "ckg", "上海": "sha", "西安": "sia", "杭州": "hgh", "海口": "hak", "郑州": "cgo",
            "昆明": "kmg", "南宁": "nng"}},
    "松原"   : {"dcity": "ysq", "acityInfo": {"北京": "bjs"}},
    "台州"   : {
        "dcity": "hyn", "acityInfo": {
            "北京": "bjs", "成都": "ctu", "重庆": "ckg", "长沙": "csx", "沈阳": "she", "深圳": "szx", "通化": "tnh", "大连": "dlc",
            "广州": "can", "贵阳": "kwe", "武汉": "wuh", "西安": "sia", "济南": "tna", "珠海": "zuh", "郑州": "cgo", "昆明": "kmg"}},
    "塔城"   : {
        "dcity"    : "tcg",
        "acityInfo": {"阿克苏": "aku", "阿勒泰": "aat", "伊宁": "yin", "博乐": "bpl", "库尔勒": "krl", "乌鲁木齐": "urc"}},
    "腾冲"   : {
        "dcity": "tcz", "acityInfo": {
            "北京": "bjs", "成都": "ctu", "长沙": "csx", "重庆": "ckg", "贵阳": "kwe", "广州": "can", "杭州": "hgh", "昆明": "kmg",
            "绵阳": "mig", "南京": "nkg", "上海": "sha", "深圳": "szx", "太原": "tyn", "武汉": "wuh", "西双版纳": "jhg", "西安": "sia",
            "郑州": "cgo"}},
    "铜仁"   : {
        "dcity": "ten", "acityInfo": {
            "北京": "bjs", "上海": "sha", "深圳": "szx", "成都": "ctu", "福州": "foc", "桂林": "kwl", "广州": "can", "贵阳": "kwe",
            "厦门": "xmn", "西安": "sia", "兴义": "acx", "郑州": "cgo", "济南": "tna"}},
    "通辽"   : {
        "dcity": "tgo", "acityInfo": {
            "北京"  : "bjs", "上海": "sha", "二连浩特": "erl", "西安": "sia", "杭州": "hgh", "呼和浩特": "het", "海拉尔": "hld",
            "哈尔滨" : "hrb",
            "霍林郭勒": "huo", "延吉": "ynj"}},
    "天水"   : {
        "dcity": "thq", "acityInfo": {
            "北京": "bjs", "常德": "cgd", "重庆": "ckg", "福州": "foc", "广州": "can", "赣州": "kow", "海口": "hak", "杭州": "hgh",
            "柳州": "lzh", "南京": "nkg", "上海": "sha", "天津": "tsn", "西安": "sia", "银川": "inc", "湛江": "zha"}},
    "吐鲁番"  : {
        "dcity": "tlq", "acityInfo": {
            "阿克苏": "aku", "长沙": "csx", "图木舒克": "twc", "广州": "can", "呼和浩特": "het", "库尔勒": "krl", "库车": "kca",
            "陇南" : "lnl",
            "兰州" : "lhw"}},
    "通化"   : {
        "dcity"    : "tnh",
        "acityInfo": {"北京": "bjs", "重庆": "ckg", "上海": "sha", "台州": "hyn", "天津": "tsn", "大连": "dlc", "广州": "can"}},
    "唐山"   : {
        "dcity": "tvs", "acityInfo": {
            "石家庄": "sjw", "沈阳": "she", "深圳": "szx", "上海": "sha", "成都": "ctu", "乌海": "wua", "广州": "can", "哈尔滨": "hrb",
            "海口" : "hak", "厦门": "xmn", "昆明": "kmg"}},
    "太原"   : {
        "dcity": "tyn", "acityInfo": {
            "北京"  : "bjs", "包头": "bav", "重庆": "ckg", "长沙": "csx", "常州": "czx", "长治": "cih", "成都": "ctu", "长春": "cgq",
            "大同"  : "dat", "恩施": "enh", "福州": "foc", "桂林": "kwl", "赣州": "kow", "广州": "can", "贵阳": "kwe", "呼和浩特": "het",
            "杭州"  : "hgh", "海口": "hak", "哈尔滨": "hrb", "惠州": "huz", "合肥": "hfe", "揭阳": "swa", "昆明": "kmg", "连云港": "lyg",
            "泸州"  : "lzo", "拉萨": "lxa", "兰州": "lhw", "临沂": "lyi", "满洲里": "nzh", "南通": "ntg", "宁波": "ngb", "南昌": "khn",
            "南京"  : "nkg", "南宁": "nng", "南阳": "nny", "泉州": "jjn", "青岛": "tao", "琼海": "bar", "日照": "riz", "三亚": "syx",
            "上海"  : "sha", "沈阳": "she", "十堰": "wds", "深圳": "szx", "天津": "tsn", "腾冲": "tcz", "温州": "wnz", "乌鲁木齐": "urc",
            "乌兰浩特": "hlh", "威海": "weh", "无锡": "wux", "万州": "wxn", "武汉": "wuh", "厦门": "xmn", "西双版纳": "jhg", "西安": "sia",
            "西宁"  : "xnn", "宜宾": "ybp", "延安": "eny", "义乌": "yiw", "宜昌": "yih", "岳阳": "yya", "烟台": "ynt", "玉林": "ylx",
            "银川"  : "inc", "张家界": "dyg", "珠海": "zuh", "遵义": "zyi"}},
    "泰州"   : {
        "dcity": "yty", "acityInfo": {
            "巴彦淖尔": "rlk", "北京": "bjs", "成都": "ctu", "重庆": "ckg", "长春": "cgq", "丹东": "ddg", "大连": "dlc", "桂林": "kwl",
            "广州"  : "can", "哈尔滨": "hrb", "海口": "hak", "昆明": "kmg", "芒市": "lum", "南昌": "khn", "泉州": "jjn", "三亚": "syx",
            "沈阳"  : "she", "深圳": "szx", "乌鲁木齐": "urc", "西双版纳": "jhg", "西安": "sia", "厦门": "xmn", "烟台": "ynt",
            "湛江"  : "zha",
            "中卫"  : "zhy"}},
    "五大连池" : {"dcity": "dtu", "acityInfo": {"哈尔滨": "hrb"}},
    "乌兰浩特" : {
        "dcity": "hlh", "acityInfo": {
            "阿尔山" : "yie", "北京": "bjs", "石家庄": "sjw", "深圳": "szx", "上海": "sha", "沈阳": "she", "成都": "ctu", "天津": "tsn",
            "呼和浩特": "het", "杭州": "hgh", "哈尔滨": "hrb"}},
    "乌兰察布" : {"dcity": "ucb", "acityInfo": {"杭州": "hgh", "郑州": "cgo"}},
    "乌鲁木齐" : {
        "dcity": "urc", "acityInfo": {
            "阿勒泰": "aat", "阿克苏": "aku", "北京": "bjs", "博乐": "bpl", "重庆": "ckg", "长沙": "csx", "长春": "cgq", "成都": "ctu",
            "东营" : "doy", "大连": "dlc", "富蕴": "fyn", "福州": "foc", "贵阳": "kwe", "广元": "gys", "广州": "can", "哈尔滨": "hrb",
            "合肥" : "hfe", "海口": "hak", "杭州": "hgh", "和田": "htn", "衡阳": "hny", "呼和浩特": "het", "汉中": "hzg", "济南": "tna",
            "金昌" : "jic", "揭阳": "swa", "库尔勒": "krl", "喀什": "khg", "克拉玛依": "kry", "库车": "kca", "昆明": "kmg", "临沂": "lyi",
            "拉萨" : "lxa", "连云港": "lyg", "泸州": "lzo", "兰州": "lhw", "绵阳": "mig", "南宁": "nng", "南阳": "nny", "南京": "nkg",
            "南昌" : "khn", "南充": "nao", "且末": "iqm", "青岛": "tao", "泉州": "jjn", "琼海": "bar", "若羌": "rqa", "石家庄": "sjw",
            "沈阳" : "she", "莎车": "qsz", "三亚": "syx", "十堰": "wds", "深圳": "szx", "上海": "sha", "塔城": "tcg", "太原": "tyn",
            "天津" : "tsn", "万州": "wxn", "武汉": "wuh", "温州": "wnz", "厦门": "xmn", "新源": "nlt", "西安": "sia", "西宁": "xnn",
            "伊宁" : "yin", "运城": "ycu", "玉林": "ylx", "义乌": "yiw", "银川": "inc", "扬州": "yty", "延安": "eny", "烟台": "ynt",
            "郑州" : "cgo", "珠海": "zuh"}},
    "潍坊"   : {
        "dcity": "wef", "acityInfo": {
            "保山": "bsd", "百色": "aeb", "深圳": "szx", "沈阳": "she", "上海": "sha", "三亚": "syx", "长春": "cgq", "长沙": "csx",
            "重庆": "ckg", "大连": "dlc", "桂林": "kwl", "广州": "can", "杭州": "hgh", "哈尔滨": "hrb", "海口": "hak", "厦门": "xmn",
            "西安": "sia", "昆明": "kmg", "南宁": "nng"}},
    "威海"   : {
        "dcity": "weh", "acityInfo": {
            "北京": "bjs", "长春": "cgq", "成都": "ctu", "重庆": "ckg", "大庆": "dqa", "丹东": "ddg", "大连": "dlc", "广州": "can",
            "杭州": "hgh", "呼和浩特": "het", "合肥": "hfe", "哈尔滨": "hrb", "济南": "tna", "牡丹江": "mdg", "宁波": "ngb", "南昌": "khn",
            "南京": "nkg", "沈阳": "she", "上海": "sha", "深圳": "szx", "石家庄": "sjw", "太原": "tyn", "西安": "sia", "烟台": "ynt"}},
    "文山"   : {
        "dcity": "wnh", "acityInfo": {
            "普洱": "sym", "保山": "bsd", "重庆": "ckg", "长沙": "csx", "成都": "ctu", "广州": "can", "贵阳": "kwe", "西双版纳": "jhg",
            "杭州": "hgh", "昆明": "kmg", "芒市": "lum"}},
    "温州"   : {
        "dcity": "wnz", "acityInfo": {
            "阿克苏": "aku", "毕节": "bfj", "巴中": "bzx", "北京": "bjs", "重庆": "ckg", "长沙": "csx", "常德": "cgd", "成都": "ctu",
            "长春" : "cgq", "大连": "dlc", "鄂尔多斯": "dsn", "阜阳": "fug", "佛山": "fuo", "桂林": "kwl", "广州": "can", "贵阳": "kwe",
            "海口" : "hak", "衡阳": "hny", "惠州": "huz", "邯郸": "hdg", "杭州": "hgh", "哈尔滨": "hrb", "呼和浩特": "het", "济南": "tna",
            "昆明" : "kmg", "六盘水": "lpf", "连云港": "lyg", "临沂": "lyi", "兰州": "lhw", "泸州": "lzo", "丽江": "ljg", "绵阳": "mig",
            "南通" : "ntg", "南宁": "nng", "南充": "nao", "黔江": "jiq", "上海": "sha", "石家庄": "sjw", "十堰": "wds", "沈阳": "she",
            "三亚" : "syx", "深圳": "szx", "天津": "tsn", "太原": "tyn", "乌鲁木齐": "urc", "万州": "wxn", "武汉": "wuh", "西宁": "xnn",
            "徐州" : "xuz", "西安": "sia", "信阳": "xai", "兴义": "acx", "西昌": "xic", "西双版纳": "jhg", "襄阳": "xfn", "银川": "inc",
            "宜昌" : "yih", "岳阳": "yya", "烟台": "ynt", "榆林": "uyn", "运城": "ycu", "珠海": "zuh", "郑州": "cgo", "遵义": "zyi"}},
    "乌海"   : {
        "dcity": "wua", "acityInfo": {
            "北京": "bjs", "上海": "sha", "石家庄": "sjw", "重庆": "ckg", "天津": "tsn", "唐山": "tvs", "广州": "can", "呼和浩特": "het",
            "西安": "sia", "郑州": "cgo"}},
    "武夷山"  : {
        "dcity": "wus", "acityInfo": {
            "青岛": "tao", "北京": "bjs", "成都": "ctu", "深圳": "szx", "广州": "can", "西安": "sia", "厦门": "xmn", "南京": "nkg"}},
    "无锡"   : {
        "dcity": "wux", "acityInfo": {
            "北京": "bjs", "成都": "ctu", "长沙": "csx", "重庆": "ckg", "长春": "cgq", "大连": "dlc", "福州": "foc", "贵阳": "kwe",
            "广州": "can", "哈尔滨": "hrb", "惠州": "huz", "锦州": "jnz", "昆明": "kmg", "丽江": "ljg", "兰州": "lhw", "临沂": "lyi",
            "南宁": "nng", "青岛": "tao", "泉州": "jjn", "三亚": "syx", "沈阳": "she", "深圳": "szx", "太原": "tyn", "西安": "sia",
            "厦门": "xmn", "兴义": "acx", "玉林": "ylx", "宜昌": "yih", "运城": "ycu", "烟台": "ynt", "珠海": "zuh", "湛江": "zha",
            "遵义": "zyi"}},
    "梧州"   : {
        "dcity": "wuz", "acityInfo": {
            "北京": "bjs", "长沙": "csx", "成都": "ctu", "上海": "sha", "三亚": "syx", "福州": "foc", "西安": "sia", "南京": "nkg"}},
    "万州"   : {
        "dcity": "wxn", "acityInfo": {
            "北京": "bjs", "长沙": "csx", "福州": "foc", "贵阳": "kwe", "广州": "can", "桂林": "kwl", "杭州": "hgh", "海口": "hak",
            "济南": "tna", "昆明": "kmg", "兰州": "lhw", "南京": "nkg", "南宁": "nng", "宁波": "ngb", "深圳": "szx", "上海": "sha",
            "太原": "tyn", "天津": "tsn", "乌鲁木齐": "urc", "温州": "wnz", "厦门": "xmn", "郑州": "cgo", "珠海": "zuh"}},
    "巫山"   : {"dcity": "wsk", "acityInfo": {"烟台": "ynt", "重庆": "ckg", "广州": "can"}},
    "兴义"   : {
        "dcity": "acx", "acityInfo": {
            "北京"  : "bjs", "毕节": "bfj", "成都": "ctu", "长沙": "csx", "重庆": "ckg", "福州": "foc", "贵阳": "kwe", "广州": "can",
            "呼和浩特": "het", "合肥": "hfe", "杭州": "hgh", "济南": "tna", "昆明": "kmg", "宁波": "ngb", "南京": "nkg", "南昌": "khn",
            "泉州"  : "jjn", "三亚": "syx", "深圳": "szx", "上海": "sha", "铜仁": "ten", "武汉": "wuh", "温州": "wnz", "西宁": "xnn",
            "西安"  : "sia", "西双版纳": "jhg", "延安": "eny", "郑州": "cgo", "遵义": "zyi"}},
    "夏河"   : {"dcity": "gxh", "acityInfo": {"西安": "sia", "成都": "ctu", "天津": "tsn", "拉萨": "lxa"}},
    "新源"   : {"dcity": "nlt", "acityInfo": {"乌鲁木齐": "urc"}},
    "忻州"   : {
        "dcity": "wut", "acityInfo": {
            "青岛": "tao", "包头": "bav", "上海": "sha", "沈阳": "she", "重庆": "ckg", "长沙": "csx", "成都": "ctu", "天津": "tsn",
            "广州": "can", "贵阳": "kwe", "呼和浩特": "het", "哈尔滨": "hrb", "杭州": "hgh", "海口": "hak", "厦门": "xmn", "南宁": "nng",
            "南京": "nkg"}},
    "信阳"   : {
        "dcity": "xai", "acityInfo": {
            "北京": "bjs", "重庆": "ckg", "成都": "ctu", "广州": "can", "杭州": "hgh", "惠州": "huz", "海口": "hak", "济南": "tna",
            "昆明": "kmg", "兰州": "lhw", "宁波": "ngb", "青岛": "tao", "上海": "sha", "深圳": "szx", "西安": "sia", "玉林": "ylx"}},
    "襄阳"   : {
        "dcity": "xfn", "acityInfo": {
            "北京": "bjs", "重庆": "ckg", "成都": "ctu", "福州": "foc", "佛山": "fuo", "广州": "can", "贵阳": "kwe", "呼和浩特": "het",
            "杭州": "hgh", "惠州": "huz", "海口": "hak", "哈尔滨": "hrb", "济南": "tna", "昆明": "kmg", "南宁": "nng", "宁波": "ngb",
            "泉州": "jjn", "青岛": "tao", "上海": "sha", "三亚": "syx", "沈阳": "she", "深圳": "szx", "天津": "tsn", "温州": "wnz",
            "厦门": "xmn", "西安": "sia", "银川": "inc", "珠海": "zuh"}},
    "西昌"   : {
        "dcity": "xic", "acityInfo": {
            "北京": "bjs", "长沙": "csx", "重庆": "ckg", "成都": "ctu", "贵阳": "kwe", "广州": "can", "海口": "hak", "昆明": "kmg",
            "兰州": "lhw", "林芝": "lzy", "泸州": "lzo", "绵阳": "mig", "宁波": "ngb", "南宁": "nng", "南京": "nkg", "深圳": "szx",
            "上海": "sha", "天津": "tsn", "武汉": "wuh", "温州": "wnz", "西双版纳": "jhg", "厦门": "xmn", "西安": "sia"}},
    "锡林浩特" : {"dcity": "xil", "acityInfo": {"呼和浩特": "het", "北京": "bjs", "上海": "sha"}},
    "西宁"   : {
        "dcity": "xnn", "acityInfo": {
            "阿克苏": "aku", "北京": "bjs", "长沙": "csx", "重庆": "ckg", "成都": "ctu", "德令哈": "hxd", "福州": "foc", "广州": "can",
            "格尔木": "goq", "贵阳": "kwe", "果洛": "gmq", "桂林": "kwl", "呼和浩特": "het", "花土沟": "htt", "哈尔滨": "hrb", "邯郸": "hdg",
            "杭州" : "hgh", "哈密": "hmi", "合肥": "hfe", "淮安": "hia", "海口": "hak", "济南": "tna", "济宁": "jng", "昆明": "kmg",
            "库尔勒": "krl", "丽江": "ljg", "泸州": "lzo", "连云港": "lyg", "拉萨": "lxa", "临沂": "lyi", "绵阳": "mig", "宁波": "ngb",
            "南通" : "ntg", "南京": "nkg", "泉州": "jjn", "祁连": "hbq", "三亚": "syx", "上海": "sha", "深圳": "szx", "太原": "tyn",
            "天津" : "tsn", "温州": "wnz", "乌鲁木齐": "urc", "武汉": "wuh", "厦门": "xmn", "西安": "sia", "徐州": "xuz", "盐城": "ynz",
            "烟台" : "ynt", "延安": "eny", "玉树": "yus", "扬州": "yty", "银川": "inc", "郑州": "cgo", "张家界": "dyg", "湛江": "zha"}},
    "徐州"   : {
        "dcity": "xuz", "acityInfo": {
            "长春"  : "cgq", "成都": "ctu", "重庆": "ckg", "长沙": "csx", "大连": "dlc", "福州": "foc", "广州": "can", "桂林": "kwl",
            "贵阳"  : "kwe", "哈尔滨": "hrb", "惠州": "huz", "海口": "hak", "揭阳": "swa", "昆明": "kmg", "丽江": "ljg", "绵阳": "mig",
            "南昌"  : "khn", "南宁": "nng", "琼海": "bar", "泉州": "jjn", "三亚": "syx", "沈阳": "she", "深圳": "szx", "温州": "wnz",
            "西双版纳": "jhg", "西宁": "xnn", "厦门": "xmn", "珠海": "zuh", "舟山": "hsn"}},
    "延安"   : {
        "dcity": "eny", "acityInfo": {
            "北京": "bjs", "重庆": "ckg", "成都": "ctu", "长沙": "csx", "福州": "foc", "广州": "can", "海口": "hak", "呼和浩特": "het",
            "杭州": "hgh", "兰州": "lhw", "南京": "nkg", "三亚": "syx", "深圳": "szx", "上海": "sha", "太原": "tyn", "乌鲁木齐": "urc",
            "西宁": "xnn", "西安": "sia", "兴义": "acx", "厦门": "xmn", "银川": "inc", "遵义": "zyi", "郑州": "cgo"}},
    "银川"   : {
        "dcity": "inc", "acityInfo": {
            "北京": "bjs", "重庆": "ckg", "成都": "ctu", "长春": "cgq", "长治": "cih", "长沙": "csx", "大同": "dat", "阜阳": "fug",
            "福州": "foc", "桂林": "kwl", "贵阳": "kwe", "固原": "gyu", "广州": "can", "汉中": "hzg", "哈尔滨": "hrb", "合肥": "hfe",
            "海口": "hak", "淮安": "hia", "惠州": "huz", "杭州": "hgh", "济南": "tna", "嘉峪关": "jgn", "库尔勒": "krl", "昆明": "kmg",
            "临沂": "lyi", "兰州": "lhw", "连云港": "lyg", "泸州": "lzo", "丽江": "ljg", "南昌": "khn", "南京": "nkg", "南通": "ntg",
            "南宁": "nng", "宁波": "ngb", "青岛": "tao", "泉州": "jjn", "琼海": "bar", "石家庄": "sjw", "三亚": "syx", "深圳": "szx",
            "十堰": "wds", "上海": "sha", "沈阳": "she", "天水": "thq", "天津": "tsn", "太原": "tyn", "温州": "wnz", "乌鲁木齐": "urc",
            "武汉": "wuh", "襄阳": "xfn", "西宁": "xnn", "西安": "sia", "兴义": "acx", "厦门": "xmn", "延安": "eny", "烟台": "ynt",
            "榆林": "uyn", "宜昌": "yih", "玉林": "ylx", "湛江": "zha", "郑州": "cgo", "珠海": "zuh"}},
    "伊春"   : {"dcity": "lds", "acityInfo": {"北京": "bjs", "上海": "sha", "沈阳": "she", "大连": "dlc", "广州": "can"}},
    "榆林"   : {
        "dcity": "uyn", "acityInfo": {
            "北京": "bjs", "长沙": "csx", "重庆": "ckg", "大连": "dlc", "广州": "can", "海口": "hak", "哈尔滨": "hrb", "杭州": "hgh",
            "合肥": "hfe", "济南": "tna", "金昌": "jic", "昆明": "kmg", "兰州": "lhw", "南宁": "nng", "南京": "nkg", "三亚": "syx",
            "上海": "sha", "天津": "tsn", "温州": "wnz", "武汉": "wuh", "西安": "sia", "银川": "inc", "郑州": "cgo", "张掖": "yzy"}},
    "宜宾"   : {
        "dcity": "ybp", "acityInfo": {
            "北京": "bjs", "长沙": "csx", "福州": "foc", "广州": "can", "海口": "hak", "杭州": "hgh", "昆明": "kmg", "拉萨": "lxa",
            "丽江": "ljg", "南京": "nkg", "南宁": "nng", "宁波": "ngb", "青岛": "tao", "三亚": "syx", "深圳": "szx", "上海": "sha",
            "太原": "tyn", "天津": "tsn", "西双版纳": "jhg", "西安": "sia", "厦门": "xmn"}},
    "运城"   : {
        "dcity": "ycu", "acityInfo": {
            "北京": "bjs", "长沙": "csx", "重庆": "ckg", "长春": "cgq", "成都": "ctu", "大连": "dlc", "福州": "foc", "广州": "can",
            "贵阳": "kwe", "杭州": "hgh", "合肥": "hfe", "呼和浩特": "het", "海口": "hak", "哈尔滨": "hrb", "济南": "tna", "昆明": "kmg",
            "丽江": "ljg", "南宁": "nng", "宁波": "ngb", "南京": "nkg", "南昌": "khn", "泉州": "jjn", "青岛": "tao", "三亚": "syx",
            "上海": "sha", "深圳": "szx", "沈阳": "she", "天津": "tsn", "温州": "wnz", "无锡": "wux", "乌鲁木齐": "urc", "武汉": "wuh",
            "厦门": "xmn", "玉林": "ylx", "珠海": "zuh"}},
    "宜春"   : {
        "dcity": "yic", "acityInfo": {
            "北京": "bjs", "深圳": "szx", "上海": "sha", "三亚": "syx", "成都": "ctu", "重庆": "ckg", "大连": "dlc", "福州": "foc",
            "贵阳": "kwe", "广州": "can", "厦门": "xmn", "西安": "sia", "海口": "hak", "昆明": "kmg", "宁波": "ngb", "南京": "nkg"}},
    "宜昌"   : {
        "dcity": "yih", "acityInfo": {
            "北京": "bjs", "重庆": "ckg", "成都": "ctu", "福州": "foc", "广州": "can", "贵阳": "kwe", "邯郸": "hdg", "黄山": "txn",
            "海口": "hak", "杭州": "hgh", "呼和浩特": "het", "济南": "tna", "揭阳": "swa", "昆明": "kmg", "兰州": "lhw", "梅州": "mxz",
            "南宁": "nng", "宁波": "ngb", "泉州": "jjn", "石家庄": "sjw", "上海": "sha", "深圳": "szx", "天津": "tsn", "太原": "tyn",
            "温州": "wnz", "无锡": "wux", "西安": "sia", "银川": "inc", "湛江": "zha", "珠海": "zuh"}},
    "伊犁"   : {
        "dcity": "yin", "acityInfo": {
            "阿克苏": "aku", "阿勒泰": "aat", "北京": "bjs", "成都": "ctu", "塔城": "tcg", "乌鲁木齐": "urc", "西安": "sia", "库尔勒": "krl",
            "库车" : "kca", "克拉玛依": "kry", "南京": "nkg"}},
    "义乌"   : {
        "dcity": "yiw", "acityInfo": {
            "青岛": "tao", "北京": "bjs", "三亚": "syx", "沈阳": "she", "深圳": "szx", "长春": "cgq", "重庆": "ckg", "成都": "ctu",
            "太原": "tyn", "天津": "tsn", "广州": "can", "贵阳": "kwe", "乌鲁木齐": "urc", "武汉": "wuh", "西安": "sia", "珠海": "zuh",
            "郑州": "cgo", "济南": "tna", "揭阳": "swa", "昆明": "kmg", "库尔勒": "krl"}},
    "营口"   : {"dcity": "ykh", "acityInfo": {"海口": "hak", "上海": "sha", "石家庄": "sjw", "南京": "nkg"}},
    "延吉"   : {
        "dcity": "ynj", "acityInfo": {
            "青岛": "tao", "北京": "bjs", "长春": "cgq", "深圳": "szx", "上海": "sha", "大连": "dlc", "通辽": "tgo", "广州": "can",
            "杭州": "hgh", "哈尔滨": "hrb", "西安": "sia", "烟台": "ynt", "宁波": "ngb"}},
    "烟台"   : {
        "dcity": "ynt", "acityInfo": {
            "北京" : "bjs", "包头": "bav", "常州": "czx", "成都": "ctu", "长春": "cgq", "重庆": "ckg", "长沙": "csx", "大连": "dlc",
            "大庆" : "dqa", "丹东": "ddg", "阜阳": "fug", "福州": "foc", "广州": "can", "贵阳": "kwe", "桂林": "kwl", "呼和浩特": "het",
            "哈尔滨": "hrb", "黄山": "txn", "衡阳": "hny", "杭州": "hgh", "惠州": "huz", "合肥": "hfe", "海口": "hak", "济南": "tna",
            "佳木斯": "jmu", "济宁": "jng", "昆明": "kmg", "临沂": "lyi", "丽江": "ljg", "牡丹江": "mdg", "南京": "nkg", "南昌": "khn",
            "南通" : "ntg", "南宁": "nng", "宁波": "ngb", "泉州": "jjn", "石家庄": "sjw", "上海": "sha", "沈阳": "she", "深圳": "szx",
            "三亚" : "syx", "天津": "tsn", "太原": "tyn", "威海": "weh", "巫山": "wsk", "乌鲁木齐": "urc", "温州": "wnz", "无锡": "wux",
            "武汉" : "wuh", "厦门": "xmn", "西宁": "xnn", "西安": "sia", "银川": "inc", "延吉": "ynj", "盐城": "ynz", "扬州": "yty",
            "郑州" : "cgo", "舟山": "hsn", "珠海": "zuh"}},
    "盐城"   : {
        "dcity": "ynz", "acityInfo": {
            "北京": "bjs", "长春": "cgq", "成都": "ctu", "长沙": "csx", "重庆": "ckg", "大连": "dlc", "广州": "can", "杭州": "hgh",
            "海口": "hak", "哈尔滨": "hrb", "揭阳": "swa", "昆明": "kmg", "南宁": "nng", "南昌": "khn", "泉州": "jjn", "深圳": "szx",
            "沈阳": "she", "三亚": "syx", "武汉": "wuh", "厦门": "xmn", "西宁": "xnn", "西安": "sia", "烟台": "ynt", "张家界": "dyg"}},
    "玉树"   : {"dcity": "yus", "acityInfo": {"西安": "sia", "西宁": "xnn", "北京": "bjs", "成都": "ctu", "拉萨": "lxa"}},
    "岳阳"   : {
        "dcity": "yya", "acityInfo": {
            "北京": "bjs", "重庆": "ckg", "成都": "ctu", "福州": "foc", "贵阳": "kwe", "惠州": "huz", "杭州": "hgh", "揭阳": "swa",
            "昆明": "kmg", "丽江": "ljg", "南通": "ntg", "青岛": "tao", "泉州": "jjn", "上海": "sha", "石家庄": "sjw", "太原": "tyn",
            "温州": "wnz", "厦门": "xmn"}},
    "张家界"  : {
        "dcity": "dyg", "acityInfo": {
            "北京": "bjs", "成都": "ctu", "重庆": "ckg", "长沙": "csx", "广州": "can", "杭州": "hgh", "惠州": "huz", "济南": "tna",
            "昆明": "kmg", "南京": "nkg", "泉州": "jjn", "深圳": "szx", "上海": "sha", "太原": "tyn", "武汉": "wuh", "西安": "sia",
            "西宁": "xnn", "盐城": "ynz", "郑州": "cgo"}},
    "舟山"   : {
        "dcity": "hsn", "acityInfo": {
            "北京": "bjs", "重庆": "ckg", "成都": "ctu", "大连": "dlc", "福州": "foc", "阜阳": "fug", "广州": "can", "济南": "tna",
            "揭阳": "swa", "连云港": "lyg", "南昌": "khn", "泉州": "jjn", "青岛": "tao", "衢州": "juz", "上饶": "sqd", "上海": "sha",
            "深圳": "szx", "天津": "tsn", "武汉": "wuh", "厦门": "xmn", "徐州": "xuz", "烟台": "ynt", "郑州": "cgo"}},
    "扎兰屯"  : {"dcity": "nzl", "acityInfo": {"呼和浩特": "het", "海拉尔": "hld", "北京": "bjs", "天津": "tsn"}},
    "张掖"   : {
        "dcity"    : "yzy",
        "acityInfo": {"北京": "bjs", "成都": "ctu", "上海": "sha", "广州": "can", "西安": "sia", "榆林": "uyn", "兰州": "lhw"}},
    "昭通"   : {
        "dcity": "zat", "acityInfo": {
            "阿克苏": "aku", "北京": "bjs", "保山": "bsd", "深圳": "szx", "上海": "sha", "成都": "ctu", "重庆": "ckg", "广州": "can",
            "西安" : "sia", "襄阳": "xfn", "西双版纳": "jhg", "杭州": "hgh", "昆明": "kmg"}},
    "湛江"   : {
        "dcity": "zha", "acityInfo": {
            "北京"  : "bjs", "长沙": "csx", "成都": "ctu", "重庆": "ckg", "大连": "dlc", "广州": "can", "赣州": "kow", "贵阳": "kwe",
            "呼和浩特": "het", "海口": "hak", "合肥": "hfe", "惠州": "huz", "杭州": "hgh", "济南": "tna", "昆明": "kmg", "丽江": "ljg",
            "梅州"  : "mxz", "南京": "nkg", "南昌": "khn", "普洱": "sym", "沈阳": "she", "三亚": "syx", "深圳": "szx", "上海": "sha",
            "太原"  : "tyn", "天津": "tsn", "武汉": "wuh", "无锡": "wux", "襄阳": "xfn", "西双版纳": "jhg", "厦门": "xmn", "宜昌": "yih",
            "珠海"  : "zuh", "郑州": "cgo"}},
    "中卫"   : {
        "dcity": "zhy", "acityInfo": {
            "西安": "sia", "北京": "bjs", "重庆": "ckg", "成都": "ctu", "上海": "sha", "石家庄": "sjw", "福州": "foc"}},
    "张家口"  : {
        "dcity": "zqz", "acityInfo": {
            "厦门": "xmn", "杭州": "hgh", "哈尔滨": "hrb", "石家庄": "sjw", "上海": "sha", "成都": "ctu", "重庆": "ckg"}},
    "珠海"   : {
        "dcity": "zuh", "acityInfo": {
            "北京" : "bjs", "保山": "bsd", "成都": "ctu", "长春": "cgq", "重庆": "ckg", "常德": "cgd", "长沙": "csx", "常州": "czx",
            "稻城" : "dcy", "达州": "dax", "大连": "dlc", "鄂尔多斯": "dsn", "福州": "foc", "贵阳": "kwe", "赣州": "kow", "合肥": "hfe",
            "黑河" : "hek", "杭州": "hgh", "淮安": "hia", "海口": "hak", "邯郸": "hdg", "哈尔滨": "hrb", "呼和浩特": "het", "衡阳": "hny",
            "井冈山": "jgs", "济南": "tna", "济宁": "jng", "揭阳": "swa", "昆明": "kmg", "连云港": "lyg", "兰州": "lhw", "泸州": "lzo",
            "洛阳" : "lya", "龙岩": "lcx", "林芝": "lzy", "梅州": "mxz", "南通": "ntg", "南京": "nkg", "南昌": "khn", "南阳": "nny",
            "宁波" : "ngb", "衢州": "juz", "青岛": "tao", "泉州": "jjn", "上海": "sha", "十堰": "wds", "沈阳": "she", "石家庄": "sjw",
            "三亚" : "syx", "太原": "tyn", "天津": "tsn", "台州": "hyn", "乌鲁木齐": "urc", "无锡": "wux", "武汉": "wuh", "万州": "wxn",
            "温州" : "wnz", "厦门": "xmn", "襄阳": "xfn", "徐州": "xuz", "西安": "sia", "烟台": "ynt", "宜昌": "yih", "银川": "inc",
            "义乌" : "yiw", "扬州": "yty", "运城": "ycu", "遵义": "zyi", "郑州": "cgo", "湛江": "zha"}},
    "遵义"   : {
        "dcity": "zyi", "acityInfo": {
            "北京": "bjs", "长沙": "csx", "成都": "ctu", "大连": "dlc", "福州": "foc", "广州": "can", "桂林": "kwl", "海口": "hak",
            "合肥": "hfe", "呼和浩特": "het", "杭州": "hgh", "兰州": "lhw", "丽江": "ljg", "南京": "nkg", "南昌": "khn", "青岛": "tao",
            "琼海": "bar", "石家庄": "sjw", "三亚": "syx", "深圳": "szx", "上海": "sha", "太原": "tyn", "天津": "tsn", "武汉": "wuh",
            "温州": "wnz", "无锡": "wux", "厦门": "xmn", "西双版纳": "jhg", "西安": "sia", "兴义": "acx", "延安": "eny", "珠海": "zuh",
            "郑州": "cgo"}},
    "安康"   : {
        "dcity": "aka", "acityInfo": {
            "北京": "bjs", "三亚": "syx", "大连": "dlc", "广州": "can", "西双版纳": "jhg", "厦门": "xmn", "杭州": "hgh", "海口": "hak",
            "济南": "tna", "梅州": "mxz", "南京": "nkg"}},
    "佛山"   : {
        "dcity": "fuo", "acityInfo": {
            "泉州": "jjn", "北京": "bjs", "上饶": "sqd", "石家庄": "sjw", "十堰": "wds", "上海": "sha", "温州": "wnz", "襄阳": "xfn",
            "昆明": "kmg"}},
    "甘孜"   : {"dcity": "gzg", "acityInfo": {"拉萨": "lxa", "成都": "ctu"}},
    "图木舒克" : {
        "dcity"    : "twc",
        "acityInfo": {"和田": "htn", "阿克苏": "aku", "伊宁": "yin", "石河子": "shf", "库尔勒": "krl", "喀什": "khg"}},
    "玉林"   : {
        "dcity": "ylx", "acityInfo": {
            "北京": "bjs", "上海": "sha", "深圳": "szx", "重庆": "ckg", "西安": "sia", "海口": "hak", "杭州": "hgh", "昆明": "kmg"}}
}
